burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Source/gd32m53x_timer.c
        /* configure the counter direction and aligned mode */
        TIMER_CTL0(timer_periph) &= (~(uint32_t)(TIMER_CTL0_DIR | TIMER_CTL0_CAM));
        TIMER_CTL0(timer_periph) |= ((uint32_t)initpara->alignedmode & TIMER_CTL0_CAM);
        TIMER_CTL0(timer_periph) |= ((uint32_t)initpara->counterdirection & TIMER_CTL0_DIR);
        TIMER_CTL0(timer_periph) &= (~(uint32_t)TIMER_CTL0_CKDIV);
        TIMER_CTL0(timer_periph) |= ((uint32_t)initpara->clockdivision & TIMER_CTL0_CKDIV);

        /* configure the autoreload value */
        TIMER_CAR(timer_periph) = (uint32_t)initpara->period;
        /* configure the repetition counter value */
        TIMER_CREP(timer_periph) = (uint32_t)initpara->repetitioncounter;
        /* generate an update event */
        TIMER_SWEVG(timer_periph) |= (uint32_t)TIMER_SWEVG_UPG;
    }
}

/*!
    \brief      enable a TIMER (API_ID(0x0004U))
    \param[in]  timer_periph: TIMERx(x=0,1,2,7)
    \param[out] none
    \retval     none
*/
void timer_enable(uint32_t timer_periph)
{
    TIMER_CTL0(timer_periph) |= (uint32_t)TIMER_CTL0_CEN;
}

/*!
    \brief      disable a TIMER (API_ID(0x0005U))
    \param[in]  timer_periph: TIMERx(x=0,1,2,7)
    \param[out] none
    \retval     none
*/
void timer_disable(uint32_t timer_periph)
{
    TIMER_CTL0(timer_periph) &= (~(uint32_t)TIMER_CTL0_CEN);
}

/*!
    \brief      enable the auto reload shadow function (API_ID(0x0006U))
    \param[in]  timer_periph: TIMERx(x=0,1,2,7)
    \param[out] none
    \retval     none
*/
void timer_auto_reload_shadow_enable(uint32_t timer_periph)
{
    TIMER_CTL0(timer_periph) |= (uint32_t)TIMER_CTL0_ARSE;
}

/*!
    \brief      disable the auto reload shadow function (API_ID(0x0007U))
    \param[in]  timer_periph: TIMERx(x=0,1,2,7)
    \param[out] none
    \retval     none
*/
void timer_auto_reload_shadow_disable(uint32_t timer_periph)
{
    TIMER_CTL0(timer_periph) &= (~(uint32_t)TIMER_CTL0_ARSE);
}

/*!
    \brief      enable the update event (API_ID(0x0008U))
    \param[in]  timer_periph: TIMERx(x=0,1,2,7)
    \param[out] none
    \retval     none
*/
void timer_update_event_enable(uint32_t timer_periph)
{
    TIMER_CTL0(timer_periph) &= (~(uint32_t)TIMER_CTL0_UPDIS);
}

/*!
    \brief      disable the update event (API_ID(0x0009U))
    \param[in]  timer_periph: TIMERx(x=0,1,2,7)
    \param[out] none
    \retval     none
*/
void timer_update_event_disable(uint32_t timer_periph)
{
    TIMER_CTL0(timer_periph) |= (uint32_t) TIMER_CTL0_UPDIS;
}

/*!
    \brief      set TIMER counter alignment mode (API_ID(0x000AU))
    \param[in]  timer_periph: TIMERx(x=0,1,2,7)
    \param[in]  aligned:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_COUNTER_EDGE: edge-aligned mode
      \arg        TIMER_COUNTER_CENTER_DOWN: center-aligned and counting down assert mode
      \arg        TIMER_COUNTER_CENTER_UP: center-aligned and counting up assert mode
      \arg        TIMER_COUNTER_CENTER_BOTH: center-aligned and counting up/down assert mode
    \param[out] none
    \retval     none
*/
void timer_counter_alignment(uint32_t timer_periph, uint16_t aligned)
{
    TIMER_CTL0(timer_periph) &= (~(uint32_t)TIMER_CTL0_CAM);
    TIMER_CTL0(timer_periph) |= ((uint32_t)aligned & TIMER_CTL0_CAM);
}

/*!
    \brief      set TIMER counter up direction (API_ID(0x000BU))
    \param[in]  timer_periph: TIMERx(x=0,1,2,7)
    \param[out] none
    \retval     none
*/
void timer_counter_up_direction(uint32_t timer_periph)
{
    TIMER_CTL0(timer_periph) &= (~(uint32_t)TIMER_CTL0_DIR);
}

/*!
    \brief      set TIMER counter down direction (API_ID(0x000CU))
    \param[in]  timer_periph: TIMERx(x=0,1,2,7)
    \param[out] none
    \retval     none
*/
void timer_counter_down_direction(uint32_t timer_periph)
{
    TIMER_CTL0(timer_periph) |= (uint32_t)TIMER_CTL0_DIR;
}

/*!
    \brief      enable upif backup (API_ID(0x000DU))
    \param[in]  timer_periph: TIMERx(x=0,1,2,7)
    \param[out] none
    \retval     none
*/
void timer_upif_backup_enable(uint32_t timer_periph)
{
    TIMER_CTL0(timer_periph) |= (uint32_t)TIMER_CTL0_UPIFBUEN;
}

/*!
    \brief      disable upif backup (API_ID(0x000EU))
    \param[in]  timer_periph: TIMERx(x=0,1,2,7)
    \param[out] none
    \retval     none
*/
void timer_upif_backup_disable(uint32_t timer_periph)
{
    TIMER_CTL0(timer_periph) &= (~(uint32_t)TIMER_CTL0_UPIFBUEN);
}

/*!
    \brief      configure the timer flow interrupt source selection (API_ID(0x000FU))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[in]  source:  interrupt source
                only one parameter can be selected which is shown as below:
      \arg        TIMER_INT_SEL_FLOW
      \arg        TIMER_INT_SEL_OVERFLOW
      \arg        TIMER_INT_SEL_UNDERFLOW
    \param[out] none
    \retval     none
*/
void timer_flow_interrupt_source_select(uint32_t timer_periph, uint32_t source)
{
    TIMER_CTL0(timer_periph) &= (~(uint32_t)TIMER_CTL0_INTCOSEL);
    TIMER_CTL0(timer_periph) |= (source & TIMER_CTL0_INTCOSEL);
}

/*!
    \brief      configure the timer update event source selection (API_ID(0x0010U))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[in]  source:  interrupt source
                only one parameter can be selected which is shown as below:
      \arg        TIMER_UPS_SEL_FLOW
      \arg        TIMER_UPS_SEL_OVERFLOW
      \arg        TIMER_UPS_SEL_UNDERFLOW
    \param[out] none
    \retval     none
*/
void timer_update_source_select(uint32_t timer_periph, uint32_t source)
{
    TIMER_CTL0(timer_periph) &= (~(uint32_t)TIMER_CTL0_UPSSEL);
    TIMER_CTL0(timer_periph) |= (source & TIMER_CTL0_UPSSEL);
}

/*!
    \brief      configure the TIMER ETI (API_ID(0x0011U))
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  source:  etr source
                only one parameter can be selected which is shown as below:
      \arg        TIMER_ETI_SEL_ETI1, TIMERx(x=0,1,2,7)
      \arg        TIMER_ETI_SEL_ETI2, TIMERx(x=0,1,2,7)
      \arg        TIMER_ETI_SEL_ETI3, TIMERx(x=1,2)
      \arg        TIMER_ETI_SEL_ETI4, TIMERx(x=1,2)
    \param[out] none
    \retval     none
*/
void timer_external_input_source_select(uint32_t timer_periph, uint32_t source)
{
    TIMER_CTL0(timer_periph) &= (~(uint32_t)TIMER_CTL0_ETISEL);
    TIMER_CTL0(timer_periph) |= (source & TIMER_CTL0_ETISEL);
}

/*!
    \brief      configure TIMER prescaler (API_ID(0x0012U))
    \param[in]  timer_periph: TIMERx(x=0,1,2,7)
    \param[in]  prescaler: prescaler value,0~65535
    \param[in]  pscreload: prescaler reload mode
                only one parameter can be selected which is shown as below:
      \arg        TIMER_PSC_RELOAD_NOW: the prescaler is loaded right now
      \arg        TIMER_PSC_RELOAD_UPDATE: the prescaler is loaded at the next update event
    \param[out] none
    \retval     none
*/
void timer_prescaler_config(uint32_t timer_periph, uint16_t prescaler, uint32_t pscreload)
{
    TIMER_PSC(timer_periph) = (uint32_t)prescaler;
    if(TIMER_PSC_RELOAD_NOW == pscreload) {
        TIMER_SWEVG(timer_periph) |= (uint32_t)TIMER_SWEVG_UPG;
    }
}

/*!
    \brief      configure timer update repetition register value (API_ID(0x0013U))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[in]  repetition: the counter repetition value, 0~255
    \param[out] none
    \retval     none
*/
void timer_update_repetition_value_config(uint32_t timer_periph, uint16_t repetition)
{
    TIMER_CREP(timer_periph) = (uint32_t)repetition;
}

/*!
    \brief      configure timer flow interrupt repetition register value (API_ID(0x0014U))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[in]  repetition: the counter repetition value, 0~255
    \param[out] none
    \retval     none
*/
void timer_flow_interrupt_repetition_value_config(uint32_t timer_periph, uint16_t repetition)
{
    TIMER_IREP(timer_periph) = (uint32_t)repetition;
}

/*!
    \brief      timer flow interrupt repetition value immediate reload (API_ID(0x0015U))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[out] none
    \retval     none
*/
void timer_flow_interrupt_repetition_value_reload(uint32_t timer_periph)
{
    TIMER_CTL0(timer_periph) |= TIMER_CTL0_INTREPRLD;
}

/*!
    \brief      configure TIMER autoreload register value (API_ID(0x0016U))
    \param[in]  timer_periph: TIMERx(x=0,1,2,7)
    \param[in]  autoreload: the counter auto-reload value,0~65535
    \param[out] none
    \retval     none
*/
void timer_autoreload_value_config(uint32_t timer_periph, uint32_t autoreload)
{
    TIMER_CAR(timer_periph) = (uint32_t)autoreload;
}

/*!
    \brief      get TIMER autoreload register value (API_ID(0x0017U))
    \param[in]  timer_periph: TIMERx(x=0,1,2,7)
    \param[out] none
    \retval     counter auto reload register value, 0~0xFFFF
*/
uint32_t timer_autoreload_value_read(uint32_t timer_periph)
{
    uint32_t autoreload = 0U;
    autoreload =  TIMER_CAR(timer_periph);
    return autoreload;
}

/*!
    \brief      configure TIMER counter register value (API_ID(0x0018U))
    \param[in]  timer_periph: TIMERx(x=0,1,2,7)
    \param[in]  counter: the counter value, 0~65535
    \param[out] none
    \retval     none
*/
void timer_counter_value_config(uint32_t timer_periph, uint32_t counter)
{
    TIMER_CNT(timer_periph) = (uint32_t)(counter & TIMER_CNT_CNT);
}

/*!
    \brief      read TIMER counter value (API_ID(0x0019U))
    \param[in]  timer_periph: TIMERx(x=0,1,2,7)
    \param[out] none
    \retval     counter value
*/
uint32_t timer_counter_read(uint32_t timer_periph)
{
    uint32_t count_value = 0U;
    count_value = (TIMER_CNT(timer_periph) & (uint32_t)TIMER_CNT_CNT);
    return (count_value);
}

/*!
    \brief      read TIMER prescaler value (API_ID(0x001AU))
    \param[in]  timer_periph: TIMERx(x=0,1,2,7)
    \param[out] none
    \retval     prescaler register value
*/
uint16_t timer_prescaler_read(uint32_t timer_periph)
{
    uint16_t prescaler_value = 0U;
    prescaler_value = (uint16_t)(TIMER_PSC(timer_periph));
    return (prescaler_value);
}

/*!
    \brief      configure TIMER single pulse mode (API_ID(0x001BU))
    \param[in]  timer_periph: TIMERx(x=0,1,2,7)
    \param[in]  spmode: pulse mode
                only one parameter can be selected which is shown as below:
      \arg        TIMER_SP_MODE_SINGLE: single pulse mode
      \arg        TIMER_SP_MODE_REPETITIVE: repetitive pulse mode
    \param[out] none
    \retval     none
*/
void timer_single_pulse_mode_config(uint32_t timer_periph, uint32_t spmode)
{
    if(TIMER_SP_MODE_SINGLE == spmode) {
        TIMER_CTL0(timer_periph) |= (uint32_t)TIMER_CTL0_SPM;
    } else if(TIMER_SP_MODE_REPETITIVE == spmode) {
        TIMER_CTL0(timer_periph) &= (~((uint32_t)TIMER_CTL0_SPM));
    } else {
        /* illegal parameters */
    }
}

/*!
    \brief      configure TIMER update source (API_ID(0x001CU))
    \param[in]  timer_periph: TIMERx(x=0,1,2,7)
    \param[in]  update: update source
                only one parameter can be selected which is shown as below:
      \arg        TIMER_UPDATE_SRC_GLOBAL: update generate by setting of UPG bit or the counter overflow/underflow,or the slave mode controller trigger
      \arg        TIMER_UPDATE_SRC_REGULAR: update generate only by counter overflow/underflow
    \param[out] none
    \retval     none
*/
void timer_update_source_config(uint32_t timer_periph, uint32_t update)
{
    if(TIMER_UPDATE_SRC_REGULAR == update) {
        TIMER_CTL0(timer_periph) |= (uint32_t)TIMER_CTL0_UPS;
    } else if(TIMER_UPDATE_SRC_GLOBAL == update) {
        TIMER_CTL0(timer_periph) &= (~(uint32_t)TIMER_CTL0_UPS);
    } else {
        /* illegal parameters */
    }
}

/*!
    \brief      enable or disable channel capture/compare control shadow register (API_ID(0x001DU))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_channel_control_shadow_config(uint32_t timer_periph, ControlStatus newvalue)
{
    if(ENABLE == newvalue) {
        TIMER_CTL1(timer_periph) |= (uint32_t)TIMER_CTL1_CCSE;
    } else {
        TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_CCSE);
    }
}

/*!
    \brief      configure TIMER channel control shadow register update control (API_ID(0x001EU))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[in]  ccuctl: channel control shadow register update control
                only one parameter can be selected which is shown as below:
      \arg        TIMER_UPDATECTL_CCU: the shadow registers update by when CMTG bit is set
      \arg        TIMER_UPDATECTL_CCUTRI: the shadow registers update by when CMTG bit is set or an rising edge of TRGI occurs
      \arg        TIMER_UPDATECTL_CCUOVERFLOW: the shadow registers update by when the overflow event occurs
      \arg        TIMER_UPDATECTL_CCUUNDERFLOW: the shadow registers update by when the underflow event occurs
      \arg        TIMER_UPDATECTL_CCUFLOW: the shadow registers update by when the overflow or underflow event occurs
    \param[out] none
    \retval     none
*/
void timer_channel_control_shadow_update_config(uint32_t timer_periph, uint32_t ccuctl)
{
    TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_CCUC);
    TIMER_CTL1(timer_periph) |= (uint32_t)(ccuctl & TIMER_CTL1_CCUC);
}

/*!
    \brief      configure TIMER OCPRE_CLR source (API_ID(0x001FU))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[in]  ocrsel: OCPRE_CLR source
                only one parameter can be selected which is shown as below:
      \arg        TIMER_OCPRE_CLR_CMP0: ocpre_clr source is CMP0
      \arg        TIMER_OCPRE_CLR_CMP1: ocpre_clr source is CMP1
      \arg        TIMER_OCPRE_CLR_CMP2: ocpre_clr source is CMP2
      \arg        TIMER_OCPRE_CLR_CMP3: ocpre_clr source is CMP3
    \param[out] none
    \retval     none
*/
void timer_ocpre_clr_source_select(uint32_t timer_periph, uint32_t ocrsel)
{
    TIMER_AFCTL(timer_periph) &= (~(uint32_t)TIMER_AFCTL_OCRINSEL);
    TIMER_AFCTL(timer_periph) |= (ocrsel & TIMER_AFCTL_OCRINSEL);
}

/*!
    \brief      configure TIMER OCPRE_CLR_INT source selection (API_ID(0x0020U))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[in]  selection: OCPRE_CLR_INT source
                only one parameter can be selected which is shown as below:
      \arg        TIMER_SMCFG_OCPRE_CLR_INPUT: OCPRE_CLR_INT is connected to the OCPRE_CLR input
      \arg        TIMER_SMCFG_OCPRE_ETI: OCPRE_CLR_INT is connected to ETIF
    \param[out] none
    \retval     none
*/
void timer_ocpre_clr_int_source_select(uint32_t timer_periph, uint32_t selection)
{
    TIMER_SMCFG(timer_periph) &= (~(uint32_t)TIMER_SMCFG_OCRC);
    TIMER_SMCFG(timer_periph) |= (selection & TIMER_SMCFG_OCRC);
}

/*!
    \brief      configure TIMER channel period point match moment OxCPRE level in the composite PWM or asymmetric PWM mode (API_ID(0x0021U))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0
      \arg        TIMER_CH_1: TIMER channel 1
      \arg        TIMER_CH_2: TIMER channel 2
      \arg        TIMER_CH_3: TIMER channel 3
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_channel_composite_asymmetric_pwm_level_config(uint32_t timer_periph, uint16_t channel, ControlStatus newvalue)
{
    switch(channel) {
    case TIMER_CH_0:
        if(ENABLE == newvalue) {
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH0PERFOREN);
            TIMER_CHCTL2(timer_periph) |= (uint32_t)TIMER_CHCTL2_CH0PERFOREN;
        } else {
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH0PERFOREN);
        }
        break;
    case TIMER_CH_1:
        if(ENABLE == newvalue) {
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH1PERFOREN);
            TIMER_CHCTL2(timer_periph) |= (uint32_t)TIMER_CHCTL2_CH1PERFOREN;
        } else {
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH1PERFOREN);
        }
        break;
    case TIMER_CH_2:
        if(ENABLE == newvalue) {
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH2PERFOREN);
            TIMER_CHCTL2(timer_periph) |= (uint32_t)TIMER_CHCTL2_CH2PERFOREN;
        } else {
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH2PERFOREN);
        }
        break;
    case TIMER_CH_3:
        if(ENABLE == newvalue) {
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH3PERFOREN);
            TIMER_CHCTL2(timer_periph) |= (uint32_t)TIMER_CHCTL2_CH3PERFOREN;
        } else {
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH3PERFOREN);
        }
        break;
    default:
        break;
    }
}

/*!
    \brief      enable the TIMER DMA (API_ID(0x0022U))
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  dma: specify which DMA to enable
                one or more parameter can be selected which is shown as below:
      \arg        TIMER_DMA_UPD:  update DMA enable,TIMERx(x=0,1,2,7)
      \arg        TIMER_DMA_CH0D: channel 0 DMA enable,TIMERx(x=0,1,2,7)
      \arg        TIMER_DMA_CH1D: channel 1 DMA enable,TIMERx(x=0,1,2,7)
      \arg        TIMER_DMA_CH2D: channel 2 DMA enable,TIMERx(x=0,1,2,7)
      \arg        TIMER_DMA_CH3D: channel 3 DMA enable,TIMERx(x=0,1,2,7)
      \arg        TIMER_DMA_CMTD: commutation DMA request enable,TIMERx(x=0,7)
      \arg        TIMER_DMA_TRGD: trigger DMA enable,TIMERx(x=0,1,2,7)
      \arg        TIMER_DMA_MCH0D: multi mode channel 0 DMA request,TIMERx(x=0,7)
      \arg        TIMER_DMA_MCH1D: multi mode channel 1 DMA request,TIMERx(x=0,7)
      \arg        TIMER_DMA_MCH2D: multi mode channel 2 DMA request,TIMERx(x=0,7)
      \arg        TIMER_DMA_MCH3D: multi mode channel 3 DMA request,TIMERx(x=0,7)
    \param[out] none
    \retval     none
*/
void timer_dma_enable(uint32_t timer_periph, uint32_t dma)
{
    TIMER_DMAINTEN(timer_periph) |= (uint32_t)(dma & TIMER_DMA_MASK);
}

/*!
    \brief      disable the TIMER DMA (API_ID(0x0023U))
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  dma: specify which DMA to enable
                one or more parameters can be selected which are shown as below:
      \arg        TIMER_DMA_UPD:  update DMA enable,TIMERx(x=0,1,2,7)
      \arg        TIMER_DMA_CH0D: channel 0 DMA enable,TIMERx(x=0,1,2,7)
      \arg        TIMER_DMA_CH1D: channel 1 DMA enable,TIMERx(x=0,1,2,7)
      \arg        TIMER_DMA_CH2D: channel 2 DMA enable,TIMERx(x=0,1,2,7)
      \arg        TIMER_DMA_CH3D: channel 3 DMA enable,TIMERx(x=0,1,2,7)
      \arg        TIMER_DMA_CMTD: commutation DMA request enable,TIMERx(x=0,7)
      \arg        TIMER_DMA_TRGD: trigger DMA enable,TIMERx(x=0,1,2,7)
      \arg        TIMER_DMA_MCH0D: multi mode channel 0 DMA request,TIMERx(x=0,7)
      \arg        TIMER_DMA_MCH1D: multi mode channel 1 DMA request,TIMERx(x=0,7)
      \arg        TIMER_DMA_MCH2D: multi mode channel 2 DMA request,TIMERx(x=0,7)
      \arg        TIMER_DMA_MCH3D: multi mode channel 3 DMA request,TIMERx(x=0,7)
    \param[out] none
    \retval     none
*/
void timer_dma_disable(uint32_t timer_periph, uint32_t dma)
{
    TIMER_DMAINTEN(timer_periph) &= (~(uint32_t)(dma & TIMER_DMA_MASK));
}

/*!
    \brief      channel DMA request source selection (API_ID(0x0024U))
    \param[in]  timer_periph: TIMERx(x=0,1,2,7)
    \param[in]  dma_request: channel DMA request source selection
                only one parameter can be selected which is shown as below:
       \arg        TIMER_DMAREQUEST_CHANNELEVENT: DMA request of channel y is sent when channel y event occurs
       \arg        TIMER_DMAREQUEST_UPDATEEVENT: DMA request of channel y is sent when update event occurs
    \param[out] none
    \retval     none
*/
void timer_channel_dma_request_source_select(uint32_t timer_periph, uint32_t dma_request)
{
    if(TIMER_DMAREQUEST_UPDATEEVENT == dma_request) {
        TIMER_CTL1(timer_periph) |= (uint32_t)TIMER_CTL1_DMAS;
    } else if(TIMER_DMAREQUEST_CHANNELEVENT == dma_request) {
        TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_DMAS);
    } else {
        /* illegal parameters */
    }
}

