burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Source/gd32m53x_timer.c
/*!
    \brief      configure TIMER channel output compare mode (API_ID(0x0030U))
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0 (TIMERx(x=0,1,2,7))
      \arg        TIMER_CH_1: TIMER channel 1 (TIMERx(x=0,1,2,7))
      \arg        TIMER_CH_2: TIMER channel 2 (TIMERx(x=0,1,2,7))
      \arg        TIMER_CH_3: TIMER channel 3 (TIMERx(x=0,1,2,7))
      \arg        TIMER_MCH_0: TIMER multi mode channel 0 (TIMERx(x=0,7))
      \arg        TIMER_MCH_1: TIMER multi mode channel 1 (TIMERx(x=0,7))
      \arg        TIMER_MCH_2: TIMER multi mode channel 2 (TIMERx(x=0,7))
      \arg        TIMER_MCH_3: TIMER multi mode channel 3 (TIMERx(x=0,7))
    \param[in]  ocmode: channel output compare mode
                only one parameter can be selected which is shown as below:
      \arg        TIMER_OC_MODE_TIMING: timing mode  (TIMERx(x=0,1,2,7))
      \arg        TIMER_OC_MODE_ACTIVE: active mode  (TIMERx(x=0,1,2,7))
      \arg        TIMER_OC_MODE_INACTIVE: inactive mode  (TIMERx(x=0,1,2,7))
      \arg        TIMER_OC_MODE_TOGGLE: toggle mode  (TIMERx(x=0,1,2,7))
      \arg        TIMER_OC_MODE_LOW: force low mode  (TIMERx(x=0,1,2,7))
      \arg        TIMER_OC_MODE_HIGH: force high mode  (TIMERx(x=0,1,2,7))
      \arg        TIMER_OC_MODE_PWM0: PWM mode 0  (TIMERx(x=0,1,2,7))
      \arg        TIMER_OC_MODE_PWM1: PWM mode 1  (TIMERx(x=0,1,2,7))
      \arg        TIMER_OC_MODE_COMPOSITE_PWM0: COMPOSITE pwm mode0    (TIMERx(x=0,7))
      \arg        TIMER_OC_MODE_COMPOSITE_PWM1: COMPOSITE pwm mode1    (TIMERx(x=0,7))
      \arg        TIMER_OC_MODE_ASYMMETRIC_PWM0: ASYMMETRIC pwm mode0  (TIMERx(x=0,7))
      \arg        TIMER_OC_MODE_ASYMMETRIC_PWM1: ASYMMETRIC pwm mode1  (TIMERx(x=0,7))
    \param[out] none
    \retval     none
*/
void timer_channel_output_mode_config(uint32_t timer_periph, uint16_t channel, uint32_t ocmode)
{
    switch(channel) {
    /* configure TIMER_CH_0 */
    case TIMER_CH_0:
        TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH0COMCTL);
        TIMER_CHCTL0(timer_periph) |= (uint32_t)(ocmode & TIMER_CHCTL0_CH0COMCTL);
        break;
    /* configure TIMER_CH_1 */
    case TIMER_CH_1:
        TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH1COMCTL);
        TIMER_CHCTL0(timer_periph) |= (uint32_t)(((uint32_t)(ocmode) << 8U) & TIMER_CHCTL0_CH1COMCTL);
        break;
    /* configure TIMER_CH_2 */
    case TIMER_CH_2:
        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH2COMCTL);
        TIMER_CHCTL1(timer_periph) |= (uint32_t)(ocmode & TIMER_CHCTL1_CH2COMCTL);
        break;
    /* configure TIMER_CH_3 */
    case TIMER_CH_3:
        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH3COMCTL);
        TIMER_CHCTL1(timer_periph) |= (uint32_t)(((uint32_t)(ocmode) << 8U) & TIMER_CHCTL1_CH3COMCTL);
        break;
    /* configure TIMER_MCH_0 */
    case TIMER_MCH_0:
        TIMER_MCHCTL0(timer_periph) &= (~(uint32_t)TIMER_MCHCTL0_MCH0COMCTL);
        TIMER_MCHCTL0(timer_periph) |= (uint32_t)(ocmode & TIMER_MCHCTL0_MCH0COMCTL);
        break;
    /* configure TIMER_MCH_1 */
    case TIMER_MCH_1:
        TIMER_MCHCTL0(timer_periph) &= (~(uint32_t)TIMER_MCHCTL0_MCH1COMCTL);
        TIMER_MCHCTL0(timer_periph) |= (uint32_t)(((uint32_t)(ocmode) << 8U) & TIMER_MCHCTL0_MCH1COMCTL);
        break;
    /* configure TIMER_MCH_2 */
    case TIMER_MCH_2:
        TIMER_MCHCTL1(timer_periph) &= (~(uint32_t)TIMER_MCHCTL1_MCH2COMCTL);
        TIMER_MCHCTL1(timer_periph) |= (uint32_t)(ocmode & TIMER_MCHCTL1_MCH2COMCTL);
        break;
    /* configure TIMER_MCH_3 */
    case TIMER_MCH_3:
        TIMER_MCHCTL1(timer_periph) &= (~(uint32_t)TIMER_MCHCTL1_MCH3COMCTL);
        TIMER_MCHCTL1(timer_periph) |= (uint32_t)(((uint32_t)(ocmode) << 8U) & TIMER_MCHCTL1_MCH3COMCTL);
        break;
    default:
        break;
    }
}

/*!
    \brief      configure TIMER channel output pulse value (API_ID(0x0031U))
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0 (TIMERx(x=0,1,2,7))
      \arg        TIMER_CH_1: TIMER channel 1 (TIMERx(x=0,1,2,7))
      \arg        TIMER_CH_2: TIMER channel 2 (TIMERx(x=0,1,2,7))
      \arg        TIMER_CH_3: TIMER channel 3 (TIMERx(x=0,1,2,7))
      \arg        TIMER_MCH_0: TIMER multi mode channel 0 (TIMERx(x=0,7))
      \arg        TIMER_MCH_1: TIMER multi mode channel 1 (TIMERx(x=0,7))
      \arg        TIMER_MCH_2: TIMER multi mode channel 2 (TIMERx(x=0,7))
      \arg        TIMER_MCH_3: TIMER multi mode channel 3 (TIMERx(x=0,7))
    \param[in]  pulse: channel output pulse value 0~65535
    \param[out] none
    \retval     none
*/
void timer_channel_output_pulse_value_config(uint32_t timer_periph, uint16_t channel, uint32_t pulse)
{
    switch(channel) {
    /* configure TIMER_CH_0 */
    case TIMER_CH_0:
        TIMER_CH0CV(timer_periph) = (uint32_t)pulse;
        break;
    /* configure TIMER_CH_1 */
    case TIMER_CH_1:
        TIMER_CH1CV(timer_periph) = (uint32_t)pulse;
        break;
    /* configure TIMER_CH_2 */
    case TIMER_CH_2:
        TIMER_CH2CV(timer_periph) = (uint32_t)pulse;
        break;
    /* configure TIMER_CH_3 */
    case TIMER_CH_3:
        TIMER_CH3CV(timer_periph) = (uint32_t)pulse;
        break;
    /* configure TIMER_MCH_0 */
    case TIMER_MCH_0:
        TIMER_MCH0CV(timer_periph) = (uint32_t)pulse;
        break;
    /* configure TIMER_MCH_1 */
    case TIMER_MCH_1:
        TIMER_MCH1CV(timer_periph) = (uint32_t)pulse;
        break;
    /* configure TIMER_MCH_2 */
    case TIMER_MCH_2:
        TIMER_MCH2CV(timer_periph) = (uint32_t)pulse;
        break;
    /* configure TIMER_MCH_3 */
    case TIMER_MCH_3:
        TIMER_MCH3CV(timer_periph) = (uint32_t)pulse;
        break;
    default:
        break;
    }
}

/*!
    \brief      configure TIMER channel output shadow function (API_ID(0x0032U))
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0 (TIMERx(x=0,1,2,7))
      \arg        TIMER_CH_1: TIMER channel 1 (TIMERx(x=0,1,2,7))
      \arg        TIMER_CH_2: TIMER channel 2 (TIMERx(x=0,1,2,7))
      \arg        TIMER_CH_3: TIMER channel 3 (TIMERx(x=0,1,2,7))
      \arg        TIMER_MCH_0: TIMER multi mode channel 0 (TIMERx(x=0,7))
      \arg        TIMER_MCH_1: TIMER multi mode channel 1 (TIMERx(x=0,7))
      \arg        TIMER_MCH_2: TIMER multi mode channel 2 (TIMERx(x=0,7))
      \arg        TIMER_MCH_3: TIMER multi mode channel 3 (TIMERx(x=0,7))
    \param[in]  ocshadow: channel output compare shadow
                only one parameter can be selected which is shown as below:
      \arg        TIMER_OC_SHADOW_ENABLE: channel output compare shadow enable
      \arg        TIMER_OC_SHADOW_DISABLE: channel output compare shadow disable
      \arg        TIMER_OMC_SHADOW_ENABLE: channel output compare shadow enable
      \arg        TIMER_OMC_SHADOW_DISABLE: channel output compare shadow disable
    \param[out] none
    \retval     none
*/
void timer_channel_output_shadow_config(uint32_t timer_periph, uint16_t channel, uint16_t ocshadow)
{
    switch(channel) {
    /* configure TIMER_CH_0 */
    case TIMER_CH_0:
        TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH0COMSEN);
        TIMER_CHCTL0(timer_periph) |= ((uint32_t)ocshadow & TIMER_CHCTL0_CH0COMSEN);
        break;
    /* configure TIMER_CH_1 */
    case TIMER_CH_1:
        TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH1COMSEN);
        TIMER_CHCTL0(timer_periph) |= (uint32_t)(((uint32_t)(ocshadow) << 8U) & TIMER_CHCTL0_CH1COMSEN);
        break;
    /* configure TIMER_CH_2 */
    case TIMER_CH_2:
        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH2COMSEN);
        TIMER_CHCTL1(timer_periph) |= ((uint32_t)ocshadow & TIMER_CHCTL1_CH2COMSEN);
        break;
    /* configure TIMER_CH_3 */
    case TIMER_CH_3:
        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH3COMSEN);
        TIMER_CHCTL1(timer_periph) |= (uint32_t)(((uint32_t)(ocshadow) << 8U) & TIMER_CHCTL1_CH3COMSEN);
        break;
    /* configure TIMER_MCH_0 */
    case TIMER_MCH_0:
        TIMER_MCHCTL0(timer_periph) &= (~(uint32_t)TIMER_MCHCTL0_MCH0COMSEN);
        TIMER_MCHCTL0(timer_periph) |= ((uint32_t)ocshadow & TIMER_MCHCTL0_MCH0COMSEN);
        break;
    /* configure TIMER_MCH_1 */
    case TIMER_MCH_1:
        TIMER_MCHCTL0(timer_periph) &= (~(uint32_t)TIMER_MCHCTL0_MCH1COMSEN);
        TIMER_MCHCTL0(timer_periph) |= (uint32_t)(((uint32_t)(ocshadow) << 8U) & TIMER_MCHCTL0_MCH1COMSEN);
        break;
    /* configure TIMER_MCH_2 */
    case TIMER_MCH_2:
        TIMER_MCHCTL1(timer_periph) &= (~(uint32_t)TIMER_MCHCTL1_MCH2COMSEN);
        TIMER_MCHCTL1(timer_periph) |= ((uint32_t)ocshadow & TIMER_MCHCTL1_MCH2COMSEN);
        break;
    /* configure TIMER_MCH_3 */
    case TIMER_MCH_3:
        TIMER_MCHCTL1(timer_periph) &= (~(uint32_t)TIMER_MCHCTL1_MCH3COMSEN);
        TIMER_MCHCTL1(timer_periph) |= (uint32_t)(((uint32_t)(ocshadow) << 8U) & TIMER_MCHCTL1_MCH3COMSEN);
        break;
    default:
        break;
    }
}

/*!
    \brief      configure TIMER channel output compare fast function (API_ID(0x0033U))
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0 (TIMERx(x=0,1,2,7))
      \arg        TIMER_CH_1: TIMER channel 1 (TIMERx(x=0,1,2,7))
      \arg        TIMER_CH_2: TIMER channel 2 (TIMERx(x=0,1,2,7))
      \arg        TIMER_CH_3: TIMER channel 3 (TIMERx(x=0,1,2,7))
      \arg        TIMER_MCH_0: TIMER multi mode channel 0 (TIMERx(x=0,7))
      \arg        TIMER_MCH_1: TIMER multi mode channel 1 (TIMERx(x=0,7))
      \arg        TIMER_MCH_2: TIMER multi mode channel 2 (TIMERx(x=0,7))
      \arg        TIMER_MCH_3: TIMER multi mode channel 3 (TIMERx(x=0,7))
    \param[in]  ocfast: channel output fast function
                only one parameter can be selected which is shown as below:
      \arg        TIMER_OC_FAST_ENABLE: channel output fast function enable
      \arg        TIMER_OC_FAST_DISABLE: channel output fast function disable
      \arg        TIMER_OMC_FAST_ENABLE: channel output fast function enable
      \arg        TIMER_OMC_FAST_DISABLE: channel output fast function disable
    \param[out] none
    \retval     none
*/
void timer_channel_output_compare_fast_config(uint32_t timer_periph, uint16_t channel, uint16_t ocfast)
{
    switch(channel) {
    /* configure TIMER_CH_0 */
    case TIMER_CH_0:
        TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH0COMFEN);
        TIMER_CHCTL0(timer_periph) |= ((uint32_t)ocfast & TIMER_CHCTL0_CH0COMFEN);
        break;
    /* configure TIMER_CH_1 */
    case TIMER_CH_1:
        TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH1COMFEN);
        TIMER_CHCTL0(timer_periph) |= (uint32_t)(((uint32_t)ocfast << 8U) & TIMER_CHCTL0_CH1COMFEN);
        break;
    /* configure TIMER_CH_2 */
    case TIMER_CH_2:
        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH2COMFEN);
        TIMER_CHCTL1(timer_periph) |= ((uint32_t)ocfast & TIMER_CHCTL1_CH2COMFEN);
        break;
    /* configure TIMER_CH_3 */
    case TIMER_CH_3:
        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH3COMFEN);
        TIMER_CHCTL1(timer_periph) |= (uint32_t)(((uint32_t)ocfast << 8U) & TIMER_CHCTL1_CH3COMFEN);
        break;
    /* configure TIMER_MCH_0 */
    case TIMER_MCH_0:
        TIMER_MCHCTL0(timer_periph) &= (~(uint32_t)TIMER_MCHCTL0_MCH0COMFEN);
        TIMER_MCHCTL0(timer_periph) |= ((uint32_t)ocfast & TIMER_MCHCTL0_MCH0COMFEN);
        break;
    /* configure TIMER_MCH_1 */
    case TIMER_MCH_1:
        TIMER_MCHCTL0(timer_periph) &= (~(uint32_t)TIMER_MCHCTL0_MCH1COMFEN);
        TIMER_MCHCTL0(timer_periph) |= (uint32_t)(((uint32_t)ocfast << 8U) & TIMER_MCHCTL0_MCH1COMFEN);
        break;
    /* configure TIMER_MCH_2 */
    case TIMER_MCH_2:
        TIMER_MCHCTL1(timer_periph) &= (~(uint32_t)TIMER_MCHCTL1_MCH2COMFEN);
        TIMER_MCHCTL1(timer_periph) |= ((uint32_t)ocfast & TIMER_MCHCTL1_MCH2COMFEN);
        break;
    /* configure TIMER_MCH_3 */
    case TIMER_MCH_3:
        TIMER_MCHCTL1(timer_periph) &= (~(uint32_t)TIMER_MCHCTL1_MCH3COMFEN);
        TIMER_MCHCTL1(timer_periph) |= (uint32_t)(((uint32_t)ocfast << 8U) & TIMER_MCHCTL1_MCH3COMFEN);
        break;
    default:
        break;
    }
}

/*!
    \brief      configure TIMER channel output clear function (API_ID(0x0034U))
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0 (TIMERx(x=0,1,2,7))
      \arg        TIMER_CH_1: TIMER channel 1 (TIMERx(x=0,1,2,7))
      \arg        TIMER_CH_2: TIMER channel 2 (TIMERx(x=0,1,2,7))
      \arg        TIMER_CH_3: TIMER channel 3 (TIMERx(x=0,1,2,7))
      \arg        TIMER_MCH_0: TIMER multi mode channel 0 (TIMERx(x=0,7))
      \arg        TIMER_MCH_1: TIMER multi mode channel 1 (TIMERx(x=0,7))
      \arg        TIMER_MCH_2: TIMER multi mode channel 2 (TIMERx(x=0,7))
      \arg        TIMER_MCH_3: TIMER multi mode channel 3 (TIMERx(x=0,7))
    \param[in]  occlear: channel output clear function
                only one parameter can be selected which is shown as below:
      \arg        TIMER_OC_CLEAR_ENABLE: channel output clear function enable
      \arg        TIMER_OC_CLEAR_DISABLE: channel output clear function disable
      \arg        TIMER_OMC_CLEAR_ENABLE: multi channel output clear function enable
      \arg        TIMER_OMC_CLEAR_DISABLE: multi channel output clear function disable
    \param[out] none
    \retval     none
*/
void timer_channel_output_clear_config(uint32_t timer_periph, uint16_t channel, uint16_t occlear)
{
    switch(channel) {
    /* configure TIMER_CH_0 */
    case TIMER_CH_0:
        TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH0COMCEN);
        TIMER_CHCTL0(timer_periph) |= ((uint32_t)occlear & TIMER_CHCTL0_CH0COMCEN);
        break;
    /* configure TIMER_CH_1 */
    case TIMER_CH_1:
        TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH1COMCEN);
        TIMER_CHCTL0(timer_periph) |= (uint32_t)(((uint32_t)occlear << 8U) & TIMER_CHCTL0_CH1COMCEN);
        break;
    /* configure TIMER_CH_2 */
    case TIMER_CH_2:
        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH2COMCEN);
        TIMER_CHCTL1(timer_periph) |= ((uint32_t)occlear & TIMER_CHCTL1_CH2COMCEN);
        break;
    /* configure TIMER_CH_3 */
    case TIMER_CH_3:
        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH3COMCEN);
        TIMER_CHCTL1(timer_periph) |= (uint32_t)(((uint32_t)occlear << 8U) & TIMER_CHCTL1_CH3COMCEN);
        break;
    /* configure TIMER_MCH_0 */
    case TIMER_MCH_0:
        TIMER_MCHCTL0(timer_periph) &= (~(uint32_t)TIMER_MCHCTL0_MCH0COMCEN);
        TIMER_MCHCTL0(timer_periph) |= ((uint32_t)occlear & TIMER_MCHCTL0_MCH0COMCEN);
        break;
    /* configure TIMER_MCH_1 */
    case TIMER_MCH_1:
        TIMER_MCHCTL0(timer_periph) &= (~(uint32_t)TIMER_MCHCTL0_MCH1COMCEN);
        TIMER_MCHCTL0(timer_periph) |= (uint32_t)(((uint32_t)occlear << 8U) & TIMER_MCHCTL0_MCH1COMCEN);
        break;
    /* configure TIMER_MCH_2 */
    case TIMER_MCH_2:
        TIMER_MCHCTL1(timer_periph) &= (~(uint32_t)TIMER_MCHCTL1_MCH2COMCEN);
        TIMER_MCHCTL1(timer_periph) |= ((uint32_t)occlear & TIMER_MCHCTL1_MCH2COMCEN);
        break;
    /* configure TIMER_MCH_3 */
    case TIMER_MCH_3:
        TIMER_MCHCTL1(timer_periph) &= (~(uint32_t)TIMER_MCHCTL1_MCH3COMCEN);
        TIMER_MCHCTL1(timer_periph) |= (uint32_t)(((uint32_t)occlear << 8U) & TIMER_MCHCTL1_MCH3COMCEN);
        break;
    default:
        break;
    }
}

/*!
    \brief      configure TIMER channel output polarity (API_ID(0x0035U))
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0 (TIMERx(x=0,1,2,7))
      \arg        TIMER_CH_1: TIMER channel 1 (TIMERx(x=0,1,2,7))
      \arg        TIMER_CH_2: TIMER channel 2 (TIMERx(x=0,1,2,7))
      \arg        TIMER_CH_3: TIMER channel 3 (TIMERx(x=0,1,2,7))
      \arg        TIMER_MCH_0: TIMER multi mode channel 0 (TIMERx(x=0,7))
      \arg        TIMER_MCH_1: TIMER multi mode channel 1 (TIMERx(x=0,7))
      \arg        TIMER_MCH_2: TIMER multi mode channel 2 (TIMERx(x=0,7))
      \arg        TIMER_MCH_3: TIMER multi mode channel 3 (TIMERx(x=0,7))
    \param[in]  ocpolarity: channel output polarity
                only one parameter can be selected which is shown as below:
      \arg        TIMER_OC_POLARITY_HIGH: channel output polarity is high
      \arg        TIMER_OC_POLARITY_LOW: channel output polarity is low
      \arg        TIMER_OMC_POLARITY_HIGH: multi mode channel output polarity is high
      \arg        TIMER_OMC_POLARITY_LOW: multi mode channel output polarity is low
    \param[out] none
    \retval     none
*/
void timer_channel_output_polarity_config(uint32_t timer_periph, uint16_t channel, uint16_t ocpolarity)
{
    switch(channel) {
    /* configure TIMER_CH_0 */
    case TIMER_CH_0:
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH0P);
        TIMER_CHCTL2(timer_periph) |= ((uint32_t)ocpolarity & TIMER_CHCTL2_CH0P);
        break;
    /* configure TIMER_CH_1 */
    case TIMER_CH_1:
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH1P);
        TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)ocpolarity << 4U) & TIMER_CHCTL2_CH1P);
        break;
    /* configure TIMER_CH_2 */
    case TIMER_CH_2:
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH2P);
        TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)ocpolarity << 8U) & TIMER_CHCTL2_CH2P);
        break;
    /* configure TIMER_CH_3 */
    case TIMER_CH_3:
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH3P);
        TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)ocpolarity << 12U) & TIMER_CHCTL2_CH3P);
        break;
    /* configure TIMER_MCH_0 */
    case TIMER_MCH_0:
        TIMER_MCHCTL2(timer_periph) &= (~(uint32_t)TIMER_MCHCTL2_MCH0FP);
        TIMER_MCHCTL2(timer_periph) |= ((uint32_t)ocpolarity & TIMER_MCHCTL2_MCH0FP);
        break;
    /* configure TIMER_MCH_1 */
    case TIMER_MCH_1:
        TIMER_MCHCTL2(timer_periph) &= (~(uint32_t)TIMER_MCHCTL2_MCH1FP);
        TIMER_MCHCTL2(timer_periph) |= (uint32_t)(((uint32_t)ocpolarity << 2U) & TIMER_MCHCTL2_MCH1FP);
        break;
    /* configure TIMER_MCH_2 */
    case TIMER_MCH_2:
        TIMER_MCHCTL2(timer_periph) &= (~(uint32_t)TIMER_MCHCTL2_MCH2FP);
        TIMER_MCHCTL2(timer_periph) |= (uint32_t)(((uint32_t)ocpolarity << 4U) & TIMER_MCHCTL2_MCH2FP);
        break;
    /* configure TIMER_MCH_3 */
    case TIMER_MCH_3:
        TIMER_MCHCTL2(timer_periph) &= (~(uint32_t)TIMER_MCHCTL2_MCH3FP);
        TIMER_MCHCTL2(timer_periph) |= (uint32_t)(((uint32_t)ocpolarity << 6U) & TIMER_MCHCTL2_MCH3FP);
        break;
    default:
        break;
    }
}

/*!
    \brief      configure TIMER channel complementary output polarity (API_ID(0x0036U))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0
      \arg        TIMER_CH_1: TIMER channel 1
      \arg        TIMER_CH_2: TIMER channel 2
      \arg        TIMER_CH_3: TIMER channel 3
    \param[in]  ocnpolarity: channel complementary output polarity
                only one parameter can be selected which is shown as below:
      \arg        TIMER_OCN_POLARITY_HIGH: channel complementary output polarity is high
      \arg        TIMER_OCN_POLARITY_LOW: channel complementary output polarity is low
    \param[out] none
    \retval     none
*/
void timer_channel_complementary_output_polarity_config(uint32_t timer_periph, uint16_t channel, uint16_t ocnpolarity)
{
    switch(channel) {
    /* configure TIMER_CH_0 */
    case TIMER_CH_0:
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH0P);
        TIMER_CHCTL2(timer_periph) |= ((uint32_t)ocnpolarity & TIMER_CHCTL2_MCH0P);
        break;
    /* configure TIMER_CH_1 */
    case TIMER_CH_1:
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH1P);
        TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)ocnpolarity << 4U) & TIMER_CHCTL2_MCH1P);
        break;
    /* configure TIMER_CH_2 */
    case TIMER_CH_2:
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH2P);
        TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)ocnpolarity << 8U) & TIMER_CHCTL2_MCH2P);
        break;
    /* configure TIMER_CH_3 */
    case TIMER_CH_3:
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH3P);
        TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)ocnpolarity << 12U) & TIMER_CHCTL2_MCH3P);
        break;
    default:
        break;
    }
}

