burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Source/gd32m53x_timer.c
            /* set the MCH0EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)TIMER_CHCTL2_MCH0EN;
            break;

        /* configure TIMER_MCH_1 */
        case TIMER_MCH_1:
            /* reset the MCH1EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH1EN);

            /* reset the MCH1FP bits */
            TIMER_MCHCTL2(timer_periph) &= (~(uint32_t)(TIMER_MCHCTL2_MCH1FP));
            switch(icpara->icpolarity) {
            case TIMER_IC_POLARITY_RISING:
                TIMER_MCHCTL2(timer_periph) |= ((uint32_t)TIMER_IMC_POLARITY_RISING << 2U);
                break;
            case TIMER_IC_POLARITY_FALLING:
                TIMER_MCHCTL2(timer_periph) |= ((uint32_t)TIMER_IMC_POLARITY_FALLING << 2U);
                break;
            case TIMER_IC_POLARITY_BOTH_EDGE:
                TIMER_MCHCTL2(timer_periph) |= ((uint32_t)TIMER_IMC_POLARITY_BOTH_EDGE << 2U);
                break;
            default:
                break;
            }
            /* reset the MCH1MS bit */
            TIMER_MCHCTL0(timer_periph) &= (~(uint32_t)TIMER_MCHCTL0_MCH1MS);
            if(TIMER_IC_SELECTION_PAIR == icpara->icselection) {
                TIMER_MCHCTL0(timer_periph) |= (((uint32_t)icpara->icselection << 29U) & TIMER_MCHCTL0_MCH1MS);
            } else {
                TIMER_MCHCTL0(timer_periph) |= (((uint32_t)(icpara->icselection) << 8U) & TIMER_MCHCTL0_MCH1MS);
            }

            /* reset the MCH1CAPFLT bit */
            TIMER_MCHCTL0(timer_periph) &= (~(uint32_t)TIMER_MCHCTL0_MCH1CAPFLT);
            TIMER_MCHCTL0(timer_periph) |= (uint32_t)(((uint32_t)(icpara->icfilter) << 12U) & TIMER_MCHCTL0_MCH1CAPFLT);

            /* set the MCH1EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)TIMER_CHCTL2_MCH1EN;
            break;
        /* configure TIMER_MCH_2 */
        case TIMER_MCH_2:
            /* reset the MCH2EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH2EN);

            /* reset the MCH2FP bits */
            TIMER_MCHCTL2(timer_periph) &= (~(uint32_t)(TIMER_MCHCTL2_MCH2FP));
            switch(icpara->icpolarity) {
            case TIMER_IC_POLARITY_RISING:
                TIMER_MCHCTL2(timer_periph) |= ((uint32_t)TIMER_IMC_POLARITY_RISING << 4U);
                break;
            case TIMER_IC_POLARITY_FALLING:
                TIMER_MCHCTL2(timer_periph) |= ((uint32_t)TIMER_IMC_POLARITY_FALLING << 4U);
                break;
            case TIMER_IC_POLARITY_BOTH_EDGE:
                TIMER_MCHCTL2(timer_periph) |= ((uint32_t)TIMER_IMC_POLARITY_BOTH_EDGE << 4U);
                break;
            default:
                break;
            }
            /* reset the MCH2MS bit */
            TIMER_MCHCTL1(timer_periph) &= (~(uint32_t)TIMER_MCHCTL1_MCH2MS);
            if(TIMER_IC_SELECTION_PAIR == icpara->icselection) {
                TIMER_MCHCTL1(timer_periph) |= (((uint32_t)icpara->icselection << 28U) & TIMER_MCHCTL1_MCH2MS);
            } else {
                TIMER_MCHCTL1(timer_periph) |= (((uint32_t)(icpara->icselection & TIMER_MCHCTL1_MCH2MS)));
            }

            /* reset the MCH2CAPFLT bit */
            TIMER_MCHCTL1(timer_periph) &= (~(uint32_t)TIMER_MCHCTL1_MCH2CAPFLT);
            TIMER_MCHCTL1(timer_periph) |= (uint32_t)(((uint32_t)(icpara->icfilter) << 4U) & TIMER_MCHCTL1_MCH2CAPFLT);

            /* set the MCH2EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)TIMER_CHCTL2_MCH2EN;
            break;
        /* configure TIMER_MCH_3 */
        case TIMER_MCH_3:
            /* reset the MCH3EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH3EN);

            /* reset the MCH3FP bits */
            TIMER_MCHCTL2(timer_periph) &= (~(uint32_t)(TIMER_MCHCTL2_MCH3FP));
            switch(icpara->icpolarity) {
            case TIMER_IC_POLARITY_RISING:
                TIMER_MCHCTL2(timer_periph) |= ((uint32_t)TIMER_IMC_POLARITY_RISING << 6U);
                break;
            case TIMER_IC_POLARITY_FALLING:
                TIMER_MCHCTL2(timer_periph) |= ((uint32_t)TIMER_IMC_POLARITY_FALLING << 6U);
                break;
            case TIMER_IC_POLARITY_BOTH_EDGE:
                TIMER_MCHCTL2(timer_periph) |= ((uint32_t)TIMER_IMC_POLARITY_BOTH_EDGE << 6U);
                break;
            default:
                break;
            }
            /* reset the MCH3MS bit */
            TIMER_MCHCTL1(timer_periph) &= (~(uint32_t)TIMER_MCHCTL1_MCH3MS);
            if(TIMER_IC_SELECTION_PAIR == icpara->icselection) {
                TIMER_MCHCTL1(timer_periph) |= (((uint32_t)icpara->icselection << 29U) & TIMER_MCHCTL1_MCH3MS);
            } else {
                TIMER_MCHCTL1(timer_periph) |= (((uint32_t)(icpara->icselection) << 8U) & TIMER_MCHCTL1_MCH3MS);
            }

            /* reset the MCH3CAPFLT bit */
            TIMER_MCHCTL1(timer_periph) &= (~(uint32_t)TIMER_MCHCTL1_MCH3CAPFLT);
            TIMER_MCHCTL1(timer_periph) |= (uint32_t)(((uint32_t)(icpara->icfilter) << 12U) & TIMER_MCHCTL1_MCH3CAPFLT);

            /* set the MCH3EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)TIMER_CHCTL2_MCH3EN;
            break;
        default:
            break;
        }
        /* configure TIMER channel input capture prescaler value */
        timer_channel_input_capture_prescaler_config(timer_periph, channel, (uint16_t)(icpara->icprescaler));
    }
}

/*!
    \brief      configure TIMER channel input capture prescaler value (API_ID(0x003BU))
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0 (TIMERx(x=0,1,2,7))
      \arg        TIMER_CH_1: TIMER channel 1 (TIMERx(x=0,1,2,7))
      \arg        TIMER_CH_2: TIMER channel 2 (TIMERx(x=0,1,2,7))
      \arg        TIMER_CH_3: TIMER channel 3 (TIMERx(x=0,1,2,7))
      \arg        TIMER_MCH_0: TIMER multi mode channel 0 (TIMERx(x=0,7))
      \arg        TIMER_MCH_1: TIMER multi mode channel 1 (TIMERx(x=0,7))
      \arg        TIMER_MCH_2: TIMER multi mode channel 2 (TIMERx(x=0,7))
      \arg        TIMER_MCH_3: TIMER multi mode channel 3 (TIMERx(x=0,7))
    \param[in]  prescaler: channel input capture prescaler value
                only one parameter can be selected which is shown as below:
      \arg        TIMER_IC_PSC_DIV1: no prescaler
      \arg        TIMER_IC_PSC_DIV2: divided by 2
      \arg        TIMER_IC_PSC_DIV4: divided by 4
      \arg        TIMER_IC_PSC_DIV8: divided by 8
    \param[out] none
    \retval     none
*/
void timer_channel_input_capture_prescaler_config(uint32_t timer_periph, uint16_t channel, uint16_t prescaler)
{
    switch(channel) {
    /* configure TIMER_CH_0 */
    case TIMER_CH_0:
        TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH0CAPPSC);
        TIMER_CHCTL0(timer_periph) |= ((uint32_t)prescaler & TIMER_CHCTL0_CH0CAPPSC);
        break;
    /* configure TIMER_CH_1 */
    case TIMER_CH_1:
        TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH1CAPPSC);
        TIMER_CHCTL0(timer_periph) |= (((uint32_t)prescaler << 8U) & TIMER_CHCTL0_CH1CAPPSC);
        break;
    /* configure TIMER_CH_2 */
    case TIMER_CH_2:
        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH2CAPPSC);
        TIMER_CHCTL1(timer_periph) |= ((uint32_t)prescaler & TIMER_CHCTL1_CH2CAPPSC);
        break;
    /* configure TIMER_CH_3 */
    case TIMER_CH_3:
        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH3CAPPSC);
        TIMER_CHCTL1(timer_periph) |= (((uint32_t)prescaler << 8U) & TIMER_CHCTL1_CH3CAPPSC);
        break;
    /* configure TIMER_MCH_0 */
    case TIMER_MCH_0:
        TIMER_MCHCTL0(timer_periph) &= (~(uint32_t)TIMER_MCHCTL0_MCH0CAPPSC);
        TIMER_MCHCTL0(timer_periph) |= ((uint32_t)prescaler & TIMER_MCHCTL0_MCH0CAPPSC);
        break;
    /* configure TIMER_MCH_1 */
    case TIMER_MCH_1:
        TIMER_MCHCTL0(timer_periph) &= (~(uint32_t)TIMER_MCHCTL0_MCH1CAPPSC);
        TIMER_MCHCTL0(timer_periph) |= (((uint32_t)prescaler << 8U) & TIMER_MCHCTL0_MCH1CAPPSC);
        break;
    /* configure TIMER_MCH_2 */
    case TIMER_MCH_2:
        TIMER_MCHCTL1(timer_periph) &= (~(uint32_t)TIMER_MCHCTL1_MCH2CAPPSC);
        TIMER_MCHCTL1(timer_periph) |= ((uint32_t)prescaler & TIMER_MCHCTL1_MCH2CAPPSC);
        break;
    /* configure TIMER_MCH_3 */
    case TIMER_MCH_3:
        TIMER_MCHCTL1(timer_periph) &= (~(uint32_t)TIMER_MCHCTL1_MCH3CAPPSC);
        TIMER_MCHCTL1(timer_periph) |= (((uint32_t)prescaler << 8U) & TIMER_MCHCTL1_MCH3CAPPSC);
        break;
    default:
        break;
    }
}

/*!
    \brief      read TIMER channel capture compare register value (API_ID(0x003CU))
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0 (TIMERx(x=0,1,2,7))
      \arg        TIMER_CH_1: TIMER channel 1 (TIMERx(x=0,1,2,7))
      \arg        TIMER_CH_2: TIMER channel 2 (TIMERx(x=0,1,2,7))
      \arg        TIMER_CH_3: TIMER channel 3 (TIMERx(x=0,1,2,7))
      \arg        TIMER_MCH_0: TIMER multi mode channel 0 (TIMERx(x=0,7))
      \arg        TIMER_MCH_1: TIMER multi mode channel 1 (TIMERx(x=0,7))
      \arg        TIMER_MCH_2: TIMER multi mode channel 2 (TIMERx(x=0,7))
      \arg        TIMER_MCH_3: TIMER multi mode channel 3 (TIMERx(x=0,7))
    \param[out] none
    \retval     channel capture compare register value(0~65535)
*/
uint32_t timer_channel_capture_value_register_read(uint32_t timer_periph, uint16_t channel)
{
    uint32_t count_value = 0U;
    switch(channel) {
    case TIMER_CH_0:
        /* read TIMER_CH_0 capture compare register value */
        count_value = TIMER_CH0CV(timer_periph);
        break;
    case TIMER_CH_1:
        /* read TIMER_CH_1 capture compare register value */
        count_value = TIMER_CH1CV(timer_periph);
        break;
    case TIMER_CH_2:
        /* read TIMER_CH_2 capture compare register value */
        count_value = TIMER_CH2CV(timer_periph);
        break;
    case TIMER_CH_3:
        /* read TIMER_CH_3 capture compare register value */
        count_value = TIMER_CH3CV(timer_periph);
        break;
    case TIMER_MCH_0:
        /* read TIMER_MCH_0 capture compare register value */
        count_value = TIMER_MCH0CV(timer_periph);
        break;
    case TIMER_MCH_1:
        /* read TIMER_MCH_1 capture compare register value */
        count_value = TIMER_MCH1CV(timer_periph);
        break;
    case TIMER_MCH_2:
        /* read TIMER_MCH_2 capture compare register value */
        count_value = TIMER_MCH2CV(timer_periph);
        break;
    case TIMER_MCH_3:
        /* read TIMER_MCH_3 capture compare register value */
        count_value = TIMER_MCH3CV(timer_periph);
        break;
    default:
        break;
    }
    return (count_value);
}

/*!
    \brief      configure TIMER input pwm capture function (API_ID(0x003DU))
    \param[in]  timer_periph: TIMERx(x=0,1,2,7)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0 (TIMERx(x=0,1,2,7))
      \arg        TIMER_CH_1: TIMER channel 1 (TIMERx(x=0,1,2,7))
     \param[in] icpwm: TIMER channel input pwm parameter struct
                  icpolarity: TIMER_IC_POLARITY_RISING, TIMER_IC_POLARITY_FALLING
                  icselection: TIMER_IC_SELECTION_DIRECTTI, TIMER_IC_SELECTION_INDIRECTTI
                  icprescaler: TIMER_IC_PSC_DIV1, TIMER_IC_PSC_DIV2, TIMER_IC_PSC_DIV4, TIMER_IC_PSC_DIV8
                  icfilter: 0~15
    \param[out] none
    \retval     none
*/
void timer_input_pwm_capture_config(uint32_t timer_periph, uint16_t channel, timer_ic_parameter_struct *icpwm)
{
    uint16_t icpolarity = 0x0000U;
    uint16_t icselection = 0x0000U;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(icpwm)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x003DU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* set channel input polarity */
        if(TIMER_IC_POLARITY_RISING == icpwm->icpolarity) {
            icpolarity = TIMER_IC_POLARITY_FALLING;
        } else {
            icpolarity = TIMER_IC_POLARITY_RISING;
        }
        /* set channel input mode selection */
        if(TIMER_IC_SELECTION_DIRECTTI == icpwm->icselection) {
            icselection = (uint16_t)TIMER_IC_SELECTION_INDIRECTTI;
        } else {
            icselection = (uint16_t)TIMER_IC_SELECTION_DIRECTTI;
        }

        if(TIMER_CH_0 == channel) {
            /* reset the CH0EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH0EN);
            /* reset the CH0P and MCH0P bits */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)(TIMER_CHCTL2_CH0P | TIMER_CHCTL2_MCH0P));
            /* set the CH0P and MCH0P bits */
            TIMER_CHCTL2(timer_periph) |= ((uint32_t)(icpwm->icpolarity) & (TIMER_CHCTL2_CH0P | TIMER_CHCTL2_MCH0P));
            /* reset the CH0MS bit */
            TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH0MS);
            /* set the CH0MS bit */
            TIMER_CHCTL0(timer_periph) |= ((uint32_t)(icpwm->icselection) & TIMER_CHCTL0_CH0MS);
            /* reset the CH0CAPFLT bit */
            TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH0CAPFLT);
            /* set the CH0CAPFLT bit */
            TIMER_CHCTL0(timer_periph) |= (((uint32_t)(icpwm->icfilter) << 4U) & TIMER_CHCTL0_CH0CAPFLT);
            /* set the CH0EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)TIMER_CHCTL2_CH0EN;
            /* configure TIMER channel input capture prescaler value */
            timer_channel_input_capture_prescaler_config(timer_periph, TIMER_CH_0, (uint16_t)(icpwm->icprescaler));

            /* reset the CH1EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH1EN);
            /* reset the CH1P and MCH1P bits */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)(TIMER_CHCTL2_CH1P | TIMER_CHCTL2_MCH1P));
            /* set the CH1P and MCH1P bits */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)icpolarity << 4U) & (TIMER_CHCTL2_CH1P | TIMER_CHCTL2_MCH1P));
            /* reset the CH1MS bit */
            TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH1MS);
            /* set the CH1MS bit */
            TIMER_CHCTL0(timer_periph) |= (uint32_t)(((uint32_t)icselection << 8U) & TIMER_CHCTL0_CH1MS);
            /* reset the CH1CAPFLT bit */
            TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH1CAPFLT);
            /* set the CH1CAPFLT bit */
            TIMER_CHCTL0(timer_periph) |= (uint32_t)(((uint32_t)(icpwm->icfilter) << 12U) & TIMER_CHCTL0_CH1CAPFLT);
            /* set the CH1EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)TIMER_CHCTL2_CH1EN;
            /* configure TIMER channel input capture prescaler value */
            timer_channel_input_capture_prescaler_config(timer_periph, TIMER_CH_1, (uint16_t)(icpwm->icprescaler));
        } else {
            /* reset the CH1EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH1EN);
            /* reset the CH1P and MCH1P bits */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)(TIMER_CHCTL2_CH1P | TIMER_CHCTL2_MCH1P));
            /* set the CH1P and MCH1P bits */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)(icpwm->icpolarity) << 4U) & (TIMER_CHCTL2_CH1P | TIMER_CHCTL2_MCH1P));
            /* reset the CH1MS bit */
            TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH1MS);
            /* set the CH1MS bit */
            TIMER_CHCTL0(timer_periph) |= (uint32_t)(((uint32_t)(icpwm->icselection) << 8U) & TIMER_CHCTL0_CH1MS);
            /* reset the CH1CAPFLT bit */
            TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH1CAPFLT);
            /* set the CH1CAPFLT bit */
            TIMER_CHCTL0(timer_periph) |= (uint32_t)(((uint32_t)(icpwm->icfilter) << 12U) & TIMER_CHCTL0_CH1CAPFLT);
            /* set the CH1EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)TIMER_CHCTL2_CH1EN;
            /* configure TIMER channel input capture prescaler value */
            timer_channel_input_capture_prescaler_config(timer_periph, TIMER_CH_1, (uint16_t)(icpwm->icprescaler));

            /* reset the CH0EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH0EN);
            /* reset the CH0P and MCH0P bits */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)(TIMER_CHCTL2_CH0P | TIMER_CHCTL2_MCH0P));
            /* set the CH0P and MCH0P bits */
            TIMER_CHCTL2(timer_periph) |= ((uint32_t)icpolarity & (TIMER_CHCTL2_CH0P | TIMER_CHCTL2_MCH0P));
            /* reset the CH0MS bit */
            TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH0MS);
            /* set the CH0MS bit */
            TIMER_CHCTL0(timer_periph) |= ((uint32_t)icselection & TIMER_CHCTL0_CH0MS);
            /* reset the CH0CAPFLT bit */
            TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH0CAPFLT);
            /* set the CH0CAPFLT bit */
            TIMER_CHCTL0(timer_periph) |= (((uint32_t)(icpwm->icfilter) << 4U) & TIMER_CHCTL0_CH0CAPFLT);
            /* set the CH0EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)TIMER_CHCTL2_CH0EN;
            /* configure TIMER channel input capture prescaler value */
            timer_channel_input_capture_prescaler_config(timer_periph, TIMER_CH_0, (uint16_t)(icpwm->icprescaler));
        }
    }
}

/*!
    \brief      configure TIMER hall sensor mode (API_ID(0x003EU))
    \param[in]  timer_periph: TIMERx(x=0,1,2,7)
    \param[in]  hallmode: TIMER hall sensor mode state
                only one parameter can be selected which is shown as below:
      \arg        TIMER_HALLINTERFACE_ENABLE: TIMER hall sensor mode enable
      \arg        TIMER_HALLINTERFACE_DISABLE: TIMER hall sensor mode disable
    \param[out] none
    \retval     none
*/
void timer_hall_mode_config(uint32_t timer_periph, uint32_t hallmode)
{
    if(TIMER_HALLINTERFACE_ENABLE == hallmode) {
        TIMER_CTL1(timer_periph) |= (uint32_t)TIMER_CTL1_TI0S;
    } else if(TIMER_HALLINTERFACE_DISABLE == hallmode) {
        TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_TI0S);
    } else {
        /* illegal parameters */
    }
}

/*!
    \brief      initialize TIMER multi mode channel output parameter struct (API_ID(0x003FU))
    \param[in]  omcpara: TIMER multi mode channel output parameter struct
    \param[out] none
    \retval     none
*/
void timer_multi_mode_channel_output_parameter_struct_init(timer_omc_parameter_struct *omcpara)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(omcpara)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x003FU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* initialize the multi mode channel output parameter struct with the default value */
        omcpara->outputmode  = TIMER_MCH_MODE_COMPLEMENTARY;
        omcpara->outputstate = TIMER_MCCX_DISABLE;
        omcpara->ocpolarity  = TIMER_OMC_POLARITY_LOW;
    }
}

/*!
    \brief      configure TIMER multi mode channel output function (API_ID(0x0040U))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[in]  channel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_MCH_0: TIMER multi mode channel 0
      \arg        TIMER_MCH_1: TIMER multi mode channel 1
      \arg        TIMER_MCH_2: TIMER multi mode channel 2
      \arg        TIMER_MCH_3: TIMER multi mode channel 3
    \param[in]  omcpara: TIMER multi mode channel output parameter struct
                  outputmode: TIMER_MCH_MODE_INDEPENDENTLY, TIMER_MCH_MODE_COMPLEMENTARY
                  outputstate: TIMER_MCCX_ENABLE, TIMER_MCCX_DISABLE
                  ocpolarity: TIMER_OMC_POLARITY_HIGH, TIMER_OMC_POLARITY_LOW
    \param[out] none
    \retval     none
*/
void timer_multi_mode_channel_output_config(uint32_t timer_periph, uint16_t channel, timer_omc_parameter_struct *omcpara)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(omcpara)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0040U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch(channel) {
        /* configure TIMER_MCH_0 */
        case TIMER_MCH_0:
            TIMER_CTL2(timer_periph) &= (~(uint32_t)TIMER_CTL2_MCH0MSEL);
            TIMER_CTL2(timer_periph) |= (uint32_t)(((uint32_t)(omcpara->outputmode) << 20U) & TIMER_CTL2_MCH0MSEL);
            /* reset the MCH0EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH0EN);
            /* set the MCH0EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)(omcpara->outputstate)) & TIMER_CHCTL2_MCH0EN);

            /* reset the MCH0FP bit */
            TIMER_MCHCTL2(timer_periph) &= (~(uint32_t)TIMER_MCHCTL2_MCH0FP);
            /* set the MCH0FP bit */
            TIMER_MCHCTL2(timer_periph) |= ((uint32_t)omcpara->ocpolarity & TIMER_MCHCTL2_MCH0FP);

            TIMER_MCHCTL0(timer_periph) &= (~(uint32_t)TIMER_MCHCTL0_MCH0MS);
            break;
        /* configure TIMER_MCH_1 */
        case TIMER_MCH_1:
            TIMER_CTL2(timer_periph) &= (~(uint32_t)TIMER_CTL2_MCH1MSEL);
            TIMER_CTL2(timer_periph) |= (uint32_t)(((uint32_t)(omcpara->outputmode) << 22U) & TIMER_CTL2_MCH1MSEL);
            /* reset the MCH1EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH1EN);
            /* set the MCH1EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)(omcpara->outputstate) << 4U) & TIMER_CHCTL2_MCH1EN);

            /* reset the MCH1FP bit */
            TIMER_MCHCTL2(timer_periph) &= (~(uint32_t)TIMER_MCHCTL2_MCH1FP);
            /* set the MCH1FP bit */
            TIMER_MCHCTL2(timer_periph) |= (uint32_t)(((uint32_t)(omcpara->ocpolarity) << 2U) & TIMER_MCHCTL2_MCH1FP);

            TIMER_MCHCTL0(timer_periph) &= (~(uint32_t)TIMER_MCHCTL0_MCH1MS);
            break;

        /* configure TIMER_MCH_2 */
        case TIMER_MCH_2:
            TIMER_CTL2(timer_periph) &= (~(uint32_t)TIMER_CTL2_MCH2MSEL);
            TIMER_CTL2(timer_periph) |= (uint32_t)(((uint32_t)(omcpara->outputmode) << 24U) & TIMER_CTL2_MCH2MSEL);
            /* reset the MCH2EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH2EN);
            /* set the MCH2EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)(omcpara->outputstate) << 8U) & TIMER_CHCTL2_MCH2EN);

            /* reset the MCH2FP bit */
            TIMER_MCHCTL2(timer_periph) &= (~(uint32_t)TIMER_MCHCTL2_MCH2FP);
            /* set the MCH2FP bit */
            TIMER_MCHCTL2(timer_periph) |= (uint32_t)(((uint32_t)(omcpara->ocpolarity) << 4U) & TIMER_MCHCTL2_MCH2FP);

            TIMER_MCHCTL1(timer_periph) &= (~(uint32_t)TIMER_MCHCTL1_MCH2MS);
            break;

