burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Source/gd32m53x_timer.c
        /* configure TIMER_MCH_3 */
        case TIMER_MCH_3:
            TIMER_CTL2(timer_periph) &= (~(uint32_t)TIMER_CTL2_MCH3MSEL);
            TIMER_CTL2(timer_periph) |= (uint32_t)(((uint32_t)(omcpara->outputmode)  << 26U) & TIMER_CTL2_MCH3MSEL);
            /* reset the MCH3EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH3EN);
            /* set the MCH3EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)(omcpara->outputstate) << 12U) & TIMER_CHCTL2_MCH3EN);

            /* reset the MCH3FP bit */
            TIMER_MCHCTL2(timer_periph) &= (~(uint32_t)TIMER_MCHCTL2_MCH3FP);
            /* set the MCH3FP bit */
            TIMER_MCHCTL2(timer_periph) |= (uint32_t)(((uint32_t)(omcpara->ocpolarity) << 6U) & TIMER_MCHCTL2_MCH3FP);

            TIMER_MCHCTL1(timer_periph) &= (~(uint32_t)TIMER_MCHCTL1_MCH3MS);
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      multi mode channel mode select (API_ID(0x0041U))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_MCH_0: TIMER multi mode channel 0
      \arg        TIMER_MCH_1: TIMER multi mode channel 1
      \arg        TIMER_MCH_2: TIMER multi mode channel 2
      \arg        TIMER_MCH_3: TIMER multi mode channel 3
    \param[in]  multi_mode_sel: multi mode channel mode selection
                only one parameter can be selected which is shown as below:
      \arg        TIMER_MCH_MODE_INDEPENDENTLY: multi mode channel work in independently mode
      \arg        TIMER_MCH_MODE_COMPLEMENTARY: multi mode channel work in complementary output mode
    \param[out] none
    \retval     none
*/
void timer_multi_mode_channel_mode_config(uint32_t timer_periph, uint32_t channel, uint32_t multi_mode_sel)
{
    uint32_t reg;
    reg = TIMER_CTL2(timer_periph);
    switch(channel) {
    /* configure TIMER_MCH_0 */
    case TIMER_MCH_0:
        reg &= (~(uint32_t)TIMER_CTL2_MCH0MSEL);
        reg |= (uint32_t)((multi_mode_sel << 20U) & TIMER_CTL2_MCH0MSEL);
        break;
    /* configure TIMER_MCH_1 */
    case TIMER_MCH_1:
        reg &= (~(uint32_t)TIMER_CTL2_MCH1MSEL);
        reg |= (uint32_t)((multi_mode_sel << 22U) & TIMER_CTL2_MCH1MSEL);
        break;
    /* configure TIMER_MCH_2 */
    case TIMER_MCH_2:
        reg &= (~(uint32_t)TIMER_CTL2_MCH2MSEL);
        reg |= (uint32_t)((multi_mode_sel << 24U) & TIMER_CTL2_MCH2MSEL);
        break;
    /* configure TIMER_MCH_3 */
    case TIMER_MCH_3:
        reg &= (~(uint32_t)TIMER_CTL2_MCH3MSEL);
        reg |= (uint32_t)((multi_mode_sel << 26U) & TIMER_CTL2_MCH3MSEL);
        break;
    default:
        break;
    }
    TIMER_CTL2(timer_periph) = reg;
}

/*!
    \brief      select TIMER input trigger source (API_ID(0x0042U))
    \param[in]  timer_periph: TIMERx(x=0,1,2,7)
    \param[in]  intrigger: input trigger source
                only one parameter can be selected which is shown as below:
      \arg        TIMER_SMCFG_TRGSEL_NONE: event mode disable
      \arg        TIMER_SMCFG_TRGSEL_ITI0: internal trigger 0
      \arg        TIMER_SMCFG_TRGSEL_ITI1: internal trigger 1
      \arg        TIMER_SMCFG_TRGSEL_ITI2: internal trigger 2
      \arg        TIMER_SMCFG_TRGSEL_ITI3: internal trigger 3
      \arg        TIMER_SMCFG_TRGSEL_CI0F_ED: TI0 edge detector
      \arg        TIMER_SMCFG_TRGSEL_CI0FE0: filtered channel 0 input
      \arg        TIMER_SMCFG_TRGSEL_CI1FE1: filtered channel 1 input
      \arg        TIMER_SMCFG_TRGSEL_ETIFP: filtered external trigger input
      \arg        TIMER_SMCFG_TRGSEL_CI2FE2: filtered channel 2 input(TIMERx(x=0,7))
      \arg        TIMER_SMCFG_TRGSEL_CI3FE3: filtered channel 3 input(TIMERx(x=0,7))
      \arg        TIMER_SMCFG_TRGSEL_MCI0FEM0: filtered multi mode channel 0 input(TIMERx(x=0,7))
      \arg        TIMER_SMCFG_TRGSEL_MCI1FEM1: filtered multi mode channel 1 input(TIMERx(x=0,7))
      \arg        TIMER_SMCFG_TRGSEL_MCI2FEM2: filtered multi mode channel 2 input(TIMERx(x=0,7))
      \arg        TIMER_SMCFG_TRGSEL_MCI3FEM3: filtered multi mode channel 3 input(TIMERx(x=0,7))
    \param[out] none
    \retval     none
*/
void timer_input_trigger_source_select(uint32_t timer_periph, uint32_t intrigger)
{
    uint32_t timer_base_addr = 0U;
    uint32_t reg_temp;
    uint32_t i = 0U;
    uint32_t j = 0U;
    uint32_t j_temp = 0U;
    uint32_t TIMERxCFG0_value, TIMERxCFG1_value, TIMERxCFG2_value;
    switch(timer_periph) {
    case TIMER0:
        timer_base_addr = ((uint32_t)(SYSCFG_BASE + 0x100U));
        break;
    case TIMER1:
        timer_base_addr = ((uint32_t)(SYSCFG_BASE + 0x10CU));
        break;
    case TIMER2:
        timer_base_addr = ((uint32_t)(SYSCFG_BASE + 0x118U));
        break;
    case TIMER7:
        timer_base_addr = ((uint32_t)(SYSCFG_BASE + 0x124U));
        break;
    default:
        break;
    }

    /* read SYSCFG_TIMERCFG0 register value */
    TIMERxCFG0_value = REG32(timer_base_addr) & 0x7FFF7FFFU;
    /* read SYSCFG_TIMERCFG1 register value */
    TIMERxCFG1_value = REG32(timer_base_addr + 4U) & 0x7FFF7FFFU;
    /* read SYSCFG_TIMERCFG2 register value */
    TIMERxCFG2_value = REG32(timer_base_addr + 8U) & 0x7FFF7FFFU;

    if((0U == TIMERxCFG0_value) && (0U == TIMERxCFG1_value) && (0U == TIMERxCFG2_value)) {
        REG32(timer_base_addr + 8U) = (uint32_t)(intrigger & TIMER_SMCFG_TRGSEL_MASK) << 16U;
    } else {
        for(i = 0U; i < 0x0CU; i += 4U) {
            if((REG32(timer_base_addr + i) & 0x7FFF7FFFU) != 0x00000000U) {
                j = 0U;
                reg_temp = REG32(timer_base_addr + i) & 0x7FFFU;
                if(0U == reg_temp) {
                    j = 16U;
                    reg_temp = (REG32(timer_base_addr + i) & 0x7FFF0000U);
                }
                j_temp = j;
                for(j = j_temp; j < 31U; j += 5U) {
                    if(reg_temp & (0x1FU << j)) {
                        REG32(timer_base_addr + i) = (uint32_t)(intrigger & TIMER_SMCFG_TRGSEL_MASK) << j;
                        break;
                    }
                }

                break;
            }
        }
    }
}

/*!
    \brief      select TIMER master mode output trigger source (API_ID(0x0043U))
    \param[in]  timer_periph: TIMERx(x=0,1,2,7)
    \param[in]  outrigger: trigger output source
                only one parameter can be selected which is shown as below:
      \arg        TIMER_TRI_OUT_SRC_RESET: the UPG bit as trigger output
      \arg        TIMER_TRI_OUT_SRC_ENABLE: the counter enable signal TIMER_CTL0_CEN as trigger output
      \arg        TIMER_TRI_OUT_SRC_UPDATE: update event as trigger output
      \arg        TIMER_TRI_OUT_SRC_CH0: a capture or a compare match occurred in channal0 as trigger output TRGO
      \arg        TIMER_TRI_OUT_SRC_O0CPRE: O0CPRE as trigger output
      \arg        TIMER_TRI_OUT_SRC_O1CPRE: O1CPRE as trigger output
      \arg        TIMER_TRI_OUT_SRC_O2CPRE: O2CPRE as trigger output
      \arg        TIMER_TRI_OUT_SRC_O3CPRE: O3CPRE as trigger output
    \param[out] none
    \retval     none
*/
void timer_master_output_trigger_source_select(uint32_t timer_periph, uint32_t outrigger)
{
    TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_MMC);
    TIMER_CTL1(timer_periph) |= ((uint32_t)outrigger & TIMER_CTL1_MMC);
}

/*!
    \brief      select TIMER slave mode (API_ID(0x0044U))
    \param[in]  timer_periph: TIMERx(x=0,1,2,7)
    \param[in]  slavemode: slave mode
                only one parameter can be selected which is shown as below:
      \arg        TIMER_SLAVE_MODE_DISABLE: slave mode disable
      \arg        TIMER_QUAD_DECODER_MODE0: quadrature decoder mode 0
      \arg        TIMER_QUAD_DECODER_MODE1: quadrature decoder mode 1
      \arg        TIMER_QUAD_DECODER_MODE2: quadrature decoder mode 2
      \arg        TIMER_SLAVE_MODE_RESTART: restart mode
      \arg        TIMER_SLAVE_MODE_PAUSE: pause mode
      \arg        TIMER_SLAVE_MODE_EVENT: event mode
      \arg        TIMER_SLAVE_MODE_EXTERNAL0: external clock mode 0
      \arg        TIMER_SLAVE_MODE_RESTART_EVENT: restart + event mode
      \arg        TIMER_NONQUAD_DECODER_MODE0: non-quadrature decoder mode 0
      \arg        TIMER_NONQUAD_DECODER_MODE1: non-quadrature decoder mode 1
      \arg        TIMER_NONQUAD_DECODER_MODE2: non-quadrature decoder mode 2
      \arg        TIMER_NONQUAD_DECODER_MODE3: non-quadrature decoder mode 3
    \param[out] none
    \retval     none
*/
void timer_slave_mode_select(uint32_t timer_periph, uint32_t slavemode)
{
    uint32_t timerxcfg_addr = 0U;
    uint32_t timer_base_addr = 0U;
    uint32_t trigger_temp = 0U;
    uint32_t trigger_off = 0U;
    uint32_t reg_temp;
    uint32_t i = 0U;
    uint32_t j = 0U;
    uint32_t TIMERxCFG0_value, TIMERxCFG1_value, TIMERxCFG2_value;

