burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Source/gd32m53x_timer.c
/*!
    \brief      break external input enable (API_ID(0x0058U))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[out] none
    \retval     none
*/
void timer_break_external_input_enable(uint32_t timer_periph)
{
    TIMER_AFCTL(timer_periph) |= (uint32_t)(TIMER_AFCTL_BRKIN0EN);
}

/*!
    \brief      break cmp enable (API_ID(0x0059U))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[in]  break_cmp:  TIMER_BRKIN_CMPx(x=0..3)
    \param[out] none
    \retval     none
*/
void timer_break_cmp_enable(uint32_t timer_periph, uint32_t break_cmp)
{
    TIMER_AFCTL(timer_periph) |= (uint32_t)((uint32_t)1U << ((break_cmp & TIMER_BRKIN_CMP_MASK) + 1U));
}

/*!
    \brief      break external input disable (API_ID(0x005AU))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[out] none
    \retval     none
*/
void timer_break_external_input_disable(uint32_t timer_periph)
{
    TIMER_AFCTL(timer_periph) &= (~(uint32_t)(TIMER_AFCTL_BRKIN0EN));
}

/*!
    \brief      break cmp disable (API_ID(0x005BU))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[in]  break_cmp: TIMER_BRKIN_CMPx(x=0..3)
    \param[out] none
    \retval     none
*/
void timer_break_cmp_disable(uint32_t timer_periph, uint32_t break_cmp)
{
    TIMER_AFCTL(timer_periph) &= (~(uint32_t)((uint32_t)1U << ((break_cmp & TIMER_BRKIN_CMP_MASK) + 1U)));
}

/*!
    \brief      configure TIMER break external input polarity (API_ID(0x005CU))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[in]  polarity: break external input polarity
                only one parameter can be selected which is shown as below:
      \arg        TIMER_BRKIN_POLARITY_NONINVERTED: input signal will not be inverted
      \arg        TIMER_BRKIN_POLARITY_INVERTED: input signal will be inverted
    \param[out] none
    \retval     none
*/
void timer_break_external_input_polarity_config(uint32_t timer_periph, uint32_t polarity)
{
    if(polarity == TIMER_BRKIN_POLARITY_INVERTED) {
        TIMER_AFCTL(timer_periph) |= (uint32_t)(TIMER_AFCTL_BRKIN0P);
    } else {
        TIMER_AFCTL(timer_periph) &= (~(uint32_t)(TIMER_AFCTL_BRKIN0P));
    }
}

/*!
    \brief      configure TIMER break cmp polarity (API_ID(0x005DU))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[in]  break_cmp: TIMER_BRKIN_CMPx(x=0..3)
    \param[in]  polarity: break cmp polarity
                only one parameter can be selected which is shown as below:
      \arg        TIMER_BRKIN_CMP_INVERTED: break cmp polarity will be inverted
      \arg        TIMER_BRKIN_CMP_NONINVERTED: break cmp polarity will not be inverted
    \param[out] none
    \retval     none
*/
void timer_break_cmp_polarity_config(uint32_t timer_periph, uint32_t break_cmp, uint32_t polarity)
{
    if(polarity == TIMER_BRKIN_CMP_INVERTED) {
        TIMER_AFCTL(timer_periph) |= (((uint32_t)(TIMER_BRKIN_CMP_INVERTED)) << ((break_cmp & TIMER_BRKIN_CMP_MASK) + 9U));
    } else {
        TIMER_AFCTL(timer_periph) &= (~(((uint32_t)(TIMER_BRKIN_CMP_INVERTED)) << ((break_cmp & TIMER_BRKIN_CMP_MASK) + 9U)));
    }
}

/*!
    \brief      break auto recover event selection (API_ID(0x005EU))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[in]  event: break auto recovery event
                only one parameter can be selected which is shown as below:
      \arg        TIMER_BRKAU_MODE_FLOW: break recover output by next flow
      \arg        TIMER_BRKAU_MODE_OVERFLOW : break recover output by next overflow
      \arg        TIMER_BRKAU_MODE_UNDERFLOW: break recover output by next underflow
      \arg        TIMER_BRKAU_MODE_UPADATE_EVENT: break recover output by next update event
    \param[out] none
    \retval     none
*/
void timer_break_auto_recover_event_select(uint32_t timer_periph, uint32_t event)
{
    TIMER_COUMSEL(timer_periph) &= (~(uint32_t)(TIMER_COUMSEL_BRKAUMS));
    TIMER_COUMSEL(timer_periph) |= (uint32_t)(event & TIMER_COUMSEL_BRKAUMS);
}

/*!
    \brief  enable timer compare event produce a ADC converter trigger signal (API_ID(0x005FU))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[in]  compare_time: ADC converter trigger signal compare time
                only one parameter can be selected which is shown as below:
       \arg       TIMER_ADCRCTL_ADT2DWGTEN:  ADC converter trigger signal (TIMERx_TRGB) enabled during CNT down-count operation
       \arg       TIMER_ADCRCTL_ADT2UPGTEN:  ADC converter trigger signal (TIMERx_TRGB) enabled during CNT up-count operation
       \arg       TIMER_ADCRCTL_ADT1DWGTEN:  ADC converter trigger signal (TIMERx_TRGA) enabled during CNT down-count operation
       \arg       TIMER_ADCRCTL_ADT1UPGTEN:  ADC converter trigger signal (TIMERx_TRGA) enabled during CNT up-count operation
    \param[out] none
    \retval     none
*/
void timer_trigger_adc_compare_enable(uint32_t timer_periph, uint32_t compare_time)
{
    TIMER_ADCRCTL(timer_periph) |= (uint32_t)(compare_time & TIMER_ADCRCTL_MASK);
}

/*!
    \brief  disable timer compare event produce a ADC converter trigger signal (API_ID(0x0060U))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[in]  compare_time: ADC converter trigger signal compare time
                only one parameter can be selected which is shown as below:
       \arg       TIMER_ADCRCTL_ADT2DWGTEN:  ADC converter trigger signal (TIMERx_TRGB) enabled during CNT down-count operation
       \arg       TIMER_ADCRCTL_ADT2UPGTEN:  ADC converter trigger signal (TIMERx_TRGB) enabled during CNT up-count operation
       \arg       TIMER_ADCRCTL_ADT1DWGTEN:  ADC converter trigger signal (TIMERx_TRGA) enabled during CNT down-count operation
       \arg       TIMER_ADCRCTL_ADT1UPGTEN:  ADC converter trigger signal (TIMERx_TRGA) enabled during CNT up-count operation
    \param[out] none
    \retval     none
*/
void timer_trigger_adc_compare_disable(uint32_t timer_periph, uint32_t compare_time)
{
    TIMER_ADCRCTL(timer_periph) &= (~(uint32_t)(compare_time & TIMER_ADCRCTL_MASK));
}

/*!
    \brief  enable timer flow event produce a ADC converter trigger signal (API_ID(0x0061U))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[in]  flow_timer: TIMER trigger ADC flow signal
                only one parameter can be selected which is shown as below:
       \arg       TIMER_ADCTL_ADTSUF:  select underflow signal
       \arg       TIMER_ADCTL_ADTSOF:  select overflow signal
    \param[out] none
    \retval     none
*/
void timer_trigger_adc_flow_enable(uint32_t timer_periph, uint32_t flow_timer)
{
    TIMER_ADCTL(timer_periph) |= (uint32_t)(flow_timer & (TIMER_ADCTL_ADTSUF | TIMER_ADCTL_ADTSOF));
}

/*!
    \brief  disable timer flow event produce a ADC converter trigger signal (API_ID(0x0062U))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[in]  flow_timer: TIMER trigger ADC flow signal
                only one parameter can be selected which is shown as below:
       \arg       TIMER_ADCTL_ADTSUF:  select underflow signal
       \arg       TIMER_ADCTL_ADTSOF:  select overflow signal
    \param[out] none
    \retval     none
*/
void timer_trigger_adc_flow_disable(uint32_t timer_periph, uint32_t flow_timer)
{
    TIMER_ADCTL(timer_periph) &= (~(uint32_t)(flow_timer & (TIMER_ADCTL_ADTSUF | TIMER_ADCTL_ADTSOF)));
}

/*!
    \brief  configure adc trigger compare value register value (API_ID(0x0063U))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[in]  compare: ADC trigger compare register
                only one parameter can be selected which is shown as below:
       \arg       TIMER_ADC_COMPARE1:  select the TIMER_ADCCR1 register
       \arg       TIMER_ADC_COMPARE2:  select the TIMER_ADCCR2 register
    \param[in]  value: 0~65535
    \param[out] none
    \retval     none
*/
void timer_trigger_adc_compare_value_config(uint32_t timer_periph, uint32_t compare,  uint16_t value)
{
    switch(compare) {
    case TIMER_ADC_COMPARE1:
        TIMER_ADCCR1(timer_periph) = (uint32_t)value;
        break;
    case TIMER_ADC_COMPARE2:
        TIMER_ADCCR2(timer_periph) = (uint32_t)value;
        break;
    default:
        /*illegal  parameter */
        break;
    }
}

/*!
    \brief  configure the TIMER trigger ADC repetition register value (API_ID(0x0064U))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[in]  timer_adc_crep: TIMER trigger ADC repetition register
                only one parameter can be selected which is shown as below:
       \arg       TIMER_ADC_REPA:  select the ADCREPA
       \arg       TIMER_ADC_REPB:  select the ADCREPB
       \arg       TIMER_ADC_REPAB:  select the ADCREPAB
    \param[in]  value: 0~15
    \param[out] none
    \retval     none
*/
void timer_trigger_adc_repetition_value_config(uint32_t timer_periph, uint32_t timer_adc_crep, uint16_t value)
{
    switch(timer_adc_crep) {
    case TIMER_ADC_REPA:
        TIMER_ADCREP(timer_periph) &= (~(uint32_t)(TIMER_ADCREP_ADCREPA));
        TIMER_ADCREP(timer_periph) |= ((uint32_t)value & TIMER_ADCREP_ADCREPA);
        break;
    case TIMER_ADC_REPB:
        TIMER_ADCREP(timer_periph) &= (~(uint32_t)(TIMER_ADCREP_ADCREPB));
        TIMER_ADCREP(timer_periph) |= (uint32_t)(((uint32_t)value << 4) & TIMER_ADCREP_ADCREPB);
        break;
    case TIMER_ADC_REPAB:
        TIMER_ADCREP(timer_periph) &= (~(uint32_t)(TIMER_ADCREP_ADCREPAB));
        TIMER_ADCREP(timer_periph) |= (uint32_t)(((uint32_t)value << 8) & TIMER_ADCREP_ADCREPAB);
        break;
    default:
        /*illegal  parameter */
        break;
    }
}

/*!
    \brief  select adc repetition decrement source (API_ID(0x0065U))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[in]  timer_adc_crep: TIMER trigger ADC repetition register
                only one parameter can be selected which is shown as below:
       \arg       TIMER_ADC_REPA:  select the ADCREPA
       \arg       TIMER_ADC_REPB:  select the ADCREPB
    \param[in]  source: decrement source
                only one parameter can be selected which is shown as below:
       \arg       TIMER_ADC_REP_DEC_OVERFLOW:  ADC repetition decrement when count overflow
       \arg       TIMER_ADC_REP_DEC_UNDERFLOW:  ADC repetition decrement when count underflow
    \param[out] none
    \retval     none
*/
void timer_trigger_adc_repetition_decrement_select(uint32_t timer_periph, uint32_t timer_adc_crep, uint16_t source)
{
    switch(timer_adc_crep) {
    case TIMER_ADC_REPA:
        if(source == TIMER_ADC_REP_DEC_UNDERFLOW) {
            TIMER_ADCTL(timer_periph) &= (~(uint32_t)TIMER_ADCTL_ADCREPAMD);
        } else if(source == TIMER_ADC_REP_DEC_OVERFLOW) {
            TIMER_ADCTL(timer_periph) |= (uint32_t)TIMER_ADCTL_ADCREPAMD;
        } else {
            /*illegal  parameter */
        }
        break;
    case TIMER_ADC_REPB:
        if(source == TIMER_ADC_REP_DEC_UNDERFLOW) {
            TIMER_ADCTL(timer_periph) &= (~(uint32_t)TIMER_ADCTL_ADCREPBMD);
        } else if(source == TIMER_ADC_REP_DEC_OVERFLOW) {
            TIMER_ADCTL(timer_periph) |= (uint32_t)TIMER_ADCTL_ADCREPBMD;
        } else {
            /*illegal  parameter */
        }
        break;
    default:
        /*illegal  parameter */
        break;
    }
}

/*!
    \brief  reload adc repetition register value (API_ID(0x0066U))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[out] none
    \retval     none
*/
void timer_trigger_adc_repetition_value_reload(uint32_t timer_periph)
{
    TIMER_ADCTL(timer_periph) |= (uint32_t)TIMER_ADCTL_ADREPRLD;
}

/*!
    \brief  enable adc compare regiseter shadow function (API_ID(0x0067U))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[in]  timer_adc_cmpval: ADC compare shadow register
                only one parameter can be selected which is shown as below:
       \arg       TIMER_ADCTL_ADTPREEN1:  select the TIMER_ADCCR1 shadow register
       \arg       TIMER_ADCTL_ADTPREEN2:  select the TIMER_ADCCR2 shadow register
    \param[out] none
    \retval     none
*/
void timer_trigger_adc_compare_value_shadow_enable(uint32_t timer_periph, uint32_t timer_adc_cmpval)
{
    TIMER_ADCTL(timer_periph) |= (uint32_t)(timer_adc_cmpval & (TIMER_ADCTL_ADTPREEN1 | TIMER_ADCTL_ADTPREEN2));
}

/*!
    \brief   disable adc compare register shadow function (API_ID(0x0068U))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[in]  timer_adc_cmpval: ADC compare shadow register
                only one parameter can be selected which is shown as below:
       \arg       TIMER_ADCTL_ADTPREEN1:  select the TIMER_ADCCR1 shadow register
       \arg       TIMER_ADCTL_ADTPREEN2:  select the TIMER_ADCCR2 shadow register
    \param[out] none
    \retval     none
*/
void timer_trigger_adc_compare_value_shadow_disable(uint32_t timer_periph, uint32_t timer_adc_cmpval)
{
    TIMER_ADCTL(timer_periph) &= (~(uint32_t)(timer_adc_cmpval & (TIMER_ADCTL_ADTPREEN1 | TIMER_ADCTL_ADTPREEN2)));
}

/*!
    \brief   configure ADC trigger signal monitoring function (API_ID(0x0069U))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[in]  adcsm: ADC signal monitor
                one or more parameters can be selected which is shown as below:
      \arg        SYSCFG_TADSRCFG_ADCSM1: ADC SM1 pin output
      \arg        SYSCFG_TADSRCFG_ADCSM2: ADC SM2 pin output
    \param[in]  adcsm_sel: source of monitor
                only one parameter can be selected which is shown as below:
       \arg       SYSCFG_ADCSM1_TIMER0_TRGOF:  source of monitor is TIMER0_TRGOF
       \arg       SYSCFG_ADCSM1_TIMER0_TRGUF:  source of monitor is TIMER0_TRGUF
       \arg       SYSCFG_ADCSM1_TIMER0_TRGA:   source of monitor is TIMER0_TRGA
       \arg       SYSCFG_ADCSM1_TIMER0_TRGB:   source of monitor is TIMER0_TRGB
       \arg       SYSCFG_ADCSM1_TIMER0_TRGAB:  source of monitor is TIMER0_TRGAB
       \arg       SYSCFG_ADCSM1_TIMER7_TRGOF:  source of monitor is TIMER7_TRGOF
       \arg       SYSCFG_ADCSM1_TIMER7_TRGUF:  source of monitor is TIMER7_TRGUF
       \arg       SYSCFG_ADCSM1_TIMER7_TRGA:   source of monitor is TIMER7_TRGA
       \arg       SYSCFG_ADCSM1_TIMER7_TRGB:   source of monitor is TIMER7_TRGB
       \arg       SYSCFG_ADCSM1_TIMER7_TRGAB:  source of monitor is TIMER7_TRGAB
       \arg       SYSCFG_ADCSM2_TIMER0_TRGOF:  source of monitor is TIMER0_TRGOF
       \arg       SYSCFG_ADCSM2_TIMER0_TRGUF:  source of monitor is TIMER0_TRGUF
       \arg       SYSCFG_ADCSM2_TIMER0_TRGA:   source of monitor is TIMER0_TRGA
       \arg       SYSCFG_ADCSM2_TIMER0_TRGB:   source of monitor is TIMER0_TRGB
       \arg       SYSCFG_ADCSM2_TIMER0_TRGAB:  source of monitor is TIMER0_TRGAB
       \arg       SYSCFG_ADCSM2_TIMER7_TRGOF:  source of monitor is TIMER7_TRGOF
       \arg       SYSCFG_ADCSM2_TIMER7_TRGUF:  source of monitor is TIMER7_TRGUF
       \arg       SYSCFG_ADCSM2_TIMER7_TRGA:   source of monitor is TIMER7_TRGA
       \arg       SYSCFG_ADCSM2_TIMER7_TRGB:   source of monitor is TIMER7_TRGB
       \arg       SYSCFG_ADCSM2_TIMER7_TRGAB:  source of monitor is TIMER7_TRGAB
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_trigger_adc_monitor_config(uint32_t timer_periph, uint32_t adcsm, uint32_t adcsm_sel, ControlStatus newvalue)
{
    if(DISABLE == newvalue) {
        syscfg_adc_signal_monitor_output_disable(adcsm);
    } else {
        syscfg_adc_signal_monitor_output_enable(adcsm);
        syscfg_adc_signal_monitor_select((syscfg_adcsm_enum)adcsm_sel);
    }
}

/*!
    \brief      register update event selection (API_ID(0x006AU))
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  reg: select shadow register
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH0CV_UPSEL : select the TIMER_CH0CV register  (TIMERx(x=0,7))
      \arg        TIMER_CH1CV_UPSEL : select the TIMER_CH1CV register  (TIMERx(x=0,7))
      \arg        TIMER_CH2CV_UPSEL : select the TIMER_CH2CV register  (TIMERx(x=0,7))
      \arg        TIMER_CH3CV_UPSEL : select the TIMER_CH3CV register  (TIMERx(x=0,7))
      \arg        TIMER_CH0CV_ADD_UPSEL : select the TIMER_CH0MOVADD register  (TIMERx(x=0,7))
      \arg        TIMER_CH1CV_ADD_UPSEL : select the TIMER_CH1MOVADD register  (TIMERx(x=0,7))
      \arg        TIMER_CH2CV_ADD_UPSEL : select the TIMER_CH2MOVADD register  (TIMERx(x=0,7))
      \arg        TIMER_CH3CV_ADD_UPSEL : select the TIMER_CH3MOVADD register  (TIMERx(x=0,7))
      \arg        TIMER_ADCCR1_UPSEL : select the TIMER_ADCCR1 register  (TIMERx(x=0,7))
      \arg        TIMER_ADCCR2_UPSEL : select the TIMER_ADCCR2 register  (TIMERx(x=0,7))
      \arg        TIMER_CAR_UPSEL : select the TIMER_CAR register  (TIMERx(x=0,7))
      \arg        TIMER_MCH0CV_UPSEL : select the TIMER_MCH0CV register  (TIMERx(x=0,7))
      \arg        TIMER_MCH1CV_UPSEL : select the TIMER_MCH1CV register  (TIMERx(x=0,7))
      \arg        TIMER_MCH2CV_UPSEL : select the TIMER_MCH2CV register  (TIMERx(x=0,7))
      \arg        TIMER_MCH3CV_UPSEL : select the TIMER_MCH3CV register  (TIMERx(x=0,7))
    \param[in]  event: select update event
                only one parameter can be selected which is shown as below:
      \arg        TIMER_UPDATE_GLOBAL:  register select global reload
      \arg        TIMER_UPDATE_NEXT_OVERFLOW: register select next overflow event
      \arg        TIMER_UPDATE_NEXT_UNDERFLOW: register select next underflow event
      \arg        TIMER_UPDATE_NEXT_FLOW: register select next flow event
      \arg        TIMER_UPDATE_NEXT_ADDCOMPARE_EVENT: register select next comapre event
    \param[out] none
    \retval     none
*/
void timer_register_update_event_select(uint32_t timer_periph, uint32_t reg, uint32_t event)
{
    if(REG_INDEX(reg) == 0U) {
        if(REG_BIT_NUM(reg) == 3U) {
            TIMER_SHUPM0(timer_periph) &= (~(uint32_t)(TIMER_UPDATE_MASK1 << (REG_BIT_POS(reg))));
            TIMER_SHUPM0(timer_periph) |= (uint32_t)((event << REG_BIT_POS(reg)) & (TIMER_UPDATE_MASK1 << (REG_BIT_POS(reg))));
        } else if(REG_BIT_NUM(reg) == 2U) {
            TIMER_SHUPM0(timer_periph) &= (~(uint32_t)(TIMER_UPDATE_MASK2 << (REG_BIT_POS(reg))));
            TIMER_SHUPM0(timer_periph) |= (uint32_t)((event << REG_BIT_POS(reg)) & (TIMER_UPDATE_MASK2 << (REG_BIT_POS(reg))));
        } else {
            /*  illegal parameters */
        }
    } else if(REG_INDEX(reg) == 1U) {
        if(REG_BIT_NUM(reg) == 3U) {
            TIMER_SHUPM1(timer_periph) &= (~(uint32_t)(TIMER_UPDATE_MASK1 << (REG_BIT_POS(reg))));
            TIMER_SHUPM1(timer_periph) |= (uint32_t)((event << REG_BIT_POS(reg)) & (TIMER_UPDATE_MASK1 << (REG_BIT_POS(reg))));
        } else if(REG_BIT_NUM(reg) == 2U) {
            TIMER_SHUPM1(timer_periph) &= (~(uint32_t)(TIMER_UPDATE_MASK2 << (REG_BIT_POS(reg))));
            TIMER_SHUPM1(timer_periph) |= (uint32_t)((event << REG_BIT_POS(reg)) & (TIMER_UPDATE_MASK2 << (REG_BIT_POS(reg))));
        } else {
            /*  illegal parameters */
        }
    } else {
        /* illegal parameters */
    }
}

/*!
    \brief      get TIMER flags (API_ID(0x006BU))
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  flag: the timer interrupt flags
                only one parameter can be selected which is shown as below:
      \arg        TIMER_FLAG_UP: update flag, TIMERx(x=0,1,2,7)
      \arg        TIMER_FLAG_CH0: TIMER channel 0 capture or compare flag, TIMERx(x=0,1,2,7)
      \arg        TIMER_FLAG_CH1: TIMER channel 1 capture or compare flag, TIMERx(x=0,1,2,7)
      \arg        TIMER_FLAG_CH2: TIMER channel 2 capture or compare flag, TIMERx(x=0,1,2,7)
      \arg        TIMER_FLAG_CH3: TIMER channel 3 capture or compare flag, TIMERx(x=0,1,2,7)
      \arg        TIMER_FLAG_CMT: TIMER commutation flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_TRG: TIMER trigger flag, TIMERx(x=0,1,2,7)
      \arg        TIMER_FLAG_BRK: TIMER break flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_CH0O: TIMER channel 0 overcapture flag, TIMERx(x=0,1,2,7)
      \arg        TIMER_FLAG_CH1O: TIMER channel 1 overcapture flag, TIMERx(x=0,1,2,7)
      \arg        TIMER_FLAG_CH2O: TIMER channel 2 overcapture flag, TIMERx(x=0,1,2,7)
      \arg        TIMER_FLAG_CH3O: TIMER channel 3 overcapture flag, TIMERx(x=0,1,2,7)
      \arg        TIMER_FLAG_MCH0: TIMER multi mode channel 0 capture or compare flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_MCH1: TIMER multi mode channel 1 capture or compare flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_MCH2: TIMER multi mode channel 2 capture or compare flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_MCH3: TIMER multi mode channel 3 capture or compare flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_SYSB: TIMER System source break interrupt flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_UNDERFLOW: TIMER cnt underflow interrupt flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_OVERFLOW: TIMER cnt overflow interrupt flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_MCH0O: TIMER multi mode channel 0 overcapture flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_MCH1O: TIMER multi mode channel 1 overcapture flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_MCH2O: TIMER multi mode channel 2 overcapture flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_MCH3O: TIMER multi mode channel 3 overcapture flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_CH0COMADD: TIMER channel 0 additional compare flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_CH1COMADD: TIMER channel 1 additional compare flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_CH2COMADD: TIMER channel 2 additional compare flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_CH3COMADD: TIMER channel 3 additional compare flag, TIMERx(x=0,7)
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus timer_flag_get(uint32_t timer_periph, uint32_t flag)
{
    FlagStatus return_val;
    if(RESET != (TIMER_INTF(timer_periph) & flag)) {
        return_val = SET;
    } else {
        return_val = RESET;
    }
    return return_val;
}

