burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Source/gd32m53x_timer.c
/*!
    \brief      clear TIMER flags (API_ID(0x006CU))
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  flag: the timer interrupt flags
                only one parameter can be selected which is shown as below:
      \arg        TIMER_FLAG_UP: update flag, TIMERx(x=0,1,2,7)
      \arg        TIMER_FLAG_CH0: TIMER channel 0 capture or compare flag, TIMERx(x=0,1,2,7)
      \arg        TIMER_FLAG_CH1: TIMER channel 1 capture or compare flag, TIMERx(x=0,1,2,7)
      \arg        TIMER_FLAG_CH2: TIMER channel 2 capture or compare flag, TIMERx(x=0,1,2,7)
      \arg        TIMER_FLAG_CH3: TIMER channel 3 capture or compare flag, TIMERx(x=0,1,2,7)
      \arg        TIMER_FLAG_CMT: TIMER commutation flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_TRG: TIMER trigger flag, TIMERx(x=0,1,2,7)
      \arg        TIMER_FLAG_BRK: TIMER break flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_CH0O: TIMER channel 0 overcapture flag, TIMERx(x=0,1,2,7)
      \arg        TIMER_FLAG_CH1O: TIMER channel 1 overcapture flag, TIMERx(x=0,1,2,7)
      \arg        TIMER_FLAG_CH2O: TIMER channel 2 overcapture flag, TIMERx(x=0,1,2,7)
      \arg        TIMER_FLAG_CH3O: TIMER channel 3 overcapture flag, TIMERx(x=0,1,2,7)
      \arg        TIMER_FLAG_MCH0: TIMER multi mode channel 0 capture or compare flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_MCH1: TIMER multi mode channel 1 capture or compare flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_MCH2: TIMER multi mode channel 2 capture or compare flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_MCH3: TIMER multi mode channel 3 capture or compare flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_SYSB: TIMER System source break interrupt flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_UNDERFLOW: TIMER cnt underflow interrupt flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_OVERFLOW: TIMER cnt overflow interrupt flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_MCH0O: TIMER multi mode channel 0 overcapture flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_MCH1O: TIMER multi mode channel 1 overcapture flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_MCH2O: TIMER multi mode channel 2 overcapture flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_MCH3O: TIMER multi mode channel 3 overcapture flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_CH0COMADD: TIMER channel 0 additional compare flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_CH1COMADD: TIMER channel 1 additional compare flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_CH2COMADD: TIMER channel 2 additional compare flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_CH3COMADD: TIMER channel 3 additional compare flag, TIMERx(x=0,7)
    \param[out] none
    \retval     none
*/
void timer_flag_clear(uint32_t timer_periph, uint32_t flag)
{
    TIMER_INTF(timer_periph) = (~(uint32_t)(flag & TIMER_FLAG_MASK));
}

/*!
    \brief      enable the TIMER interrupt (API_ID(0x006DU))
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  interrupt: timer interrupt enable source
                only one parameter can be selected which is shown as below:
      \arg        TIMER_INT_UP: TIMER update interrupt, TIMERx(x=0,1,2,7)
      \arg        TIMER_INT_CH0: TIMER channel 0 capture or compare interrupt, TIMERx(x=0,1,2,7)
      \arg        TIMER_INT_CH1: TIMER channel 1 capture or compare interrupt, TIMERx(x=0,1,2,7)
      \arg        TIMER_INT_CH2: TIMER channel 2 capture or compare interrupt, TIMERx(x=0,1,2,7)
      \arg        TIMER_INT_CH3: TIMER channel 3 capture or compare interrupt, TIMERx(x=0,1,2,7)
      \arg        TIMER_INT_CMT: TIMER commutation interrupt, TIMERx(x=0,7)
      \arg        TIMER_INT_TRG: TIMER trigger interrupt, TIMERx(x=0,1,2,7)
      \arg        TIMER_INT_BRK: TIMER break interrupt, TIMERx(x=0,7)
      \arg        TIMER_INT_FLOW: TIMER cnt flow interrupt, TIMERx(x=0,7)
      \arg        TIMER_INT_MCH0: TIMER multi mode channel 0 capture or compare interrupt, TIMERx(x=0,7)
      \arg        TIMER_INT_MCH1: TIMER multi mode channel 1 capture or compare interrupt, TIMERx(x=0,7)
      \arg        TIMER_INT_MCH2: TIMER multi mode channel 2 capture or compare interrupt, TIMERx(x=0,7)
      \arg        TIMER_INT_MCH3: TIMER multi mode channel 3 capture or compare interrupt, TIMERx(x=0,7)
      \arg        TIMER_INT_CH0COMADD: TIMER channel 0 additional compare interrupt, TIMERx(x=0,7)
      \arg        TIMER_INT_CH1COMADD: TIMER channel 1 additional compare interrupt, TIMERx(x=0,7)
      \arg        TIMER_INT_CH2COMADD: TIMER channel 2 additional compare interrupt, TIMERx(x=0,7)
      \arg        TIMER_INT_CH3COMADD: TIMER channel 3 additional compare interrupt, TIMERx(x=0,7)
    \param[out] none
    \retval     none
*/
void timer_interrupt_enable(uint32_t timer_periph, uint32_t interrupt)
{
    TIMER_DMAINTEN(timer_periph) |= (uint32_t)(interrupt & TIMER_INTEN_MASK);
}

/*!
    \brief      disable the TIMER interrupt (API_ID(0x006EU))
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  interrupt: timer interrupt source disable
                only one parameter can be selected which is shown as below:
      \arg        TIMER_INT_UP: TIMER update interrupt, TIMERx(x=0,1,2,7)
      \arg        TIMER_INT_CH0: TIMER channel 0 capture or compare interrupt, TIMERx(x=0,1,2,7)
      \arg        TIMER_INT_CH1: TIMER channel 1 capture or compare interrupt, TIMERx(x=0,1,2,7)
      \arg        TIMER_INT_CH2: TIMER channel 2 capture or compare interrupt, TIMERx(x=0,1,2,7)
      \arg        TIMER_INT_CH3: TIMER channel 3 capture or compare interrupt, TIMERx(x=0,1,2,7)
      \arg        TIMER_INT_CMT: TIMER commutation interrupt, TIMERx(x=0,7)
      \arg        TIMER_INT_TRG: TIMER trigger interrupt, TIMERx(x=0,1,2,7)
      \arg        TIMER_INT_BRK: TIMER break interrupt, TIMERx(x=0,7)
      \arg        TIMER_INT_FLOW: TIMER cnt flow interrupt, TIMERx(x=0,7)
      \arg        TIMER_INT_MCH0: TIMER multi mode channel 0 capture or compare interrupt, TIMERx(x=0,7)
      \arg        TIMER_INT_MCH1: TIMER multi mode channel 1 capture or compare interrupt, TIMERx(x=0,7)
      \arg        TIMER_INT_MCH2: TIMER multi mode channel 2 capture or compare interrupt, TIMERx(x=0,7)
      \arg        TIMER_INT_MCH3: TIMER multi mode channel 3 capture or compare interrupt, TIMERx(x=0,7)
      \arg        TIMER_INT_CH0COMADD: TIMER channel 0 additional compare interrupt, TIMERx(x=0,7)
      \arg        TIMER_INT_CH1COMADD: TIMER channel 1 additional compare interrupt, TIMERx(x=0,7)
      \arg        TIMER_INT_CH2COMADD: TIMER channel 2 additional compare interrupt, TIMERx(x=0,7)
      \arg        TIMER_INT_CH3COMADD: TIMER channel 3 additional compare interrupt, TIMERx(x=0,7)
    \param[out] none
    \retval     none
*/
void timer_interrupt_disable(uint32_t timer_periph, uint32_t interrupt)
{
    TIMER_DMAINTEN(timer_periph) &= (~(uint32_t)(interrupt & TIMER_INTEN_MASK));
}

/*!
    \brief      get timer interrupt flag (API_ID(0x006FU))
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  int_flag: the timer interrupt bits
                only one parameter can be selected which is shown as below:
      \arg        TIMER_INT_FLAG_UP: TIMER update interrupt flag, TIMERx(x=0,1,2,7)
      \arg        TIMER_INT_FLAG_CH0: TIMER channel 0 capture or compare interrupt flag, TIMERx(x=0,1,2,7)
      \arg        TIMER_INT_FLAG_CH1: TIMER channel 1 capture or compare interrupt flag, TIMERx(x=0,1,2,7)
      \arg        TIMER_INT_FLAG_CH2: TIMER channel 2 capture or compare interrupt flag, TIMERx(x=0,1,2,7)
      \arg        TIMER_INT_FLAG_CH3: TIMER channel 3 capture or compare interrupt flag, TIMERx(x=0,1,2,7)
      \arg        TIMER_INT_FLAG_CMT: TIMER channel commutation interrupt flag, TIMERx(x=0,7)
      \arg        TIMER_INT_FLAG_TRG: TIMER trigger interrupt flag, TIMERx(x=0,1,2,7)
      \arg        TIMER_INT_FLAG_BRK: TIMER break interrupt flag, TIMERx(x=0,7)
      \arg        TIMER_INT_FLAG_UNDERFLOW: TIMER cnt underflow flag, TIMERx(x=0,7)
      \arg        TIMER_INT_FLAG_OVERFLOW: TIMER cnt overflow flag, TIMERx(x=0,7)
      \arg        TIMER_INT_FLAG_MCH0: TIMER multi mode channel 0 capture or compare interrupt flag, TIMERx(x=0,7)
      \arg        TIMER_INT_FLAG_MCH1: TIMER multi mode channel 1 capture or compare interrupt flag, TIMERx(x=0,7)
      \arg        TIMER_INT_FLAG_MCH2: TIMER multi mode channel 2 capture or compare interrupt flag, TIMERx(x=0,7)
      \arg        TIMER_INT_FLAG_MCH3: TIMER multi mode channel 3 capture or compare interrupt flag, TIMERx(x=0,7)
      \arg        TIMER_INT_FLAG_CH0COMADD: TIMER channel 0 additional compare interrupt flag, TIMERx(x=0,7)
      \arg        TIMER_INT_FLAG_CH1COMADD: TIMER channel 1 additional compare interrupt flag, TIMERx(x=0,7)
      \arg        TIMER_INT_FLAG_CH2COMADD: TIMER channel 2 additional compare interrupt flag, TIMERx(x=0,7)
      \arg        TIMER_INT_FLAG_CH3COMADD: TIMER channel 3 additional compare interrupt flag, TIMERx(x=0,7)
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus timer_interrupt_flag_get(uint32_t timer_periph, uint32_t int_flag)
{
    uint32_t val;
    FlagStatus return_val;
    val = (TIMER_DMAINTEN(timer_periph) & int_flag);
    if(int_flag == TIMER_INT_FLAG_OVERFLOW) {
        val = (TIMER_DMAINTEN(timer_periph) << 1 & int_flag);
    }
    if((RESET != (TIMER_INTF(timer_periph) & int_flag)) && (RESET != val)) {
        return_val = SET;
    } else {
        return_val = RESET;
    }
    return return_val;
}

/*!
    \brief      clear timer interrupt flag (API_ID(0x0070U))
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  int_flag: the timer interrupt bits
                only one parameter can be selected which is shown as below:
      \arg        TIMER_INT_FLAG_UP: TIMER update interrupt flag, TIMERx(x=0,1,2,7)
      \arg        TIMER_INT_FLAG_CH0: TIMER channel 0 capture or compare interrupt flag, TIMERx(x=0,1,2,7)
      \arg        TIMER_INT_FLAG_CH1: TIMER channel 1 capture or compare interrupt flag, TIMERx(x=0,1,2,7)
      \arg        TIMER_INT_FLAG_CH2: TIMER channel 2 capture or compare interrupt flag, TIMERx(x=0,1,2,7)
      \arg        TIMER_INT_FLAG_CH3: TIMER channel 3 capture or compare interrupt flag, TIMERx(x=0,1,2,7)
      \arg        TIMER_INT_FLAG_CMT: TIMER channel commutation interrupt flag, TIMERx(x=0,7)
      \arg        TIMER_INT_FLAG_TRG: TIMER trigger interrupt flag, TIMERx(x=0,1,2,7)
      \arg        TIMER_INT_FLAG_BRK: TIMER break interrupt flag, TIMERx(x=0,7)
      \arg        TIMER_INT_FLAG_UNDERFLOW: TIMER cnt underflow flag, TIMERx(x=0,7)
      \arg        TIMER_INT_FLAG_OVERFLOW: TIMER cnt overflow flag, TIMERx(x=0,7)
      \arg        TIMER_INT_FLAG_MCH0: TIMER multi mode channel 0 capture or compare interrupt flag, TIMERx(x=0,7)
      \arg        TIMER_INT_FLAG_MCH1: TIMER multi mode channel 1 capture or compare interrupt flag, TIMERx(x=0,7)
      \arg        TIMER_INT_FLAG_MCH2: TIMER multi mode channel 2 capture or compare interrupt flag, TIMERx(x=0,7)
      \arg        TIMER_INT_FLAG_MCH3: TIMER multi mode channel 3 capture or compare interrupt flag, TIMERx(x=0,7)
      \arg        TIMER_INT_FLAG_CH0COMADD: TIMER channel 0 additional compare interrupt flag, TIMERx(x=0,1,2,7)
      \arg        TIMER_INT_FLAG_CH1COMADD: TIMER channel 1 additional compare interrupt flag, TIMERx(x=0,1,2,7)
      \arg        TIMER_INT_FLAG_CH2COMADD: TIMER channel 2 additional compare interrupt flag, TIMERx(x=0,1,2,7)
      \arg        TIMER_INT_FLAG_CH3COMADD: TIMER channel 3 additional compare interrupt flag, TIMERx(x=0,1,2,7)
    \param[out] none
    \retval
*/
void timer_interrupt_flag_clear(uint32_t timer_periph, uint32_t int_flag)
{
    TIMER_INTF(timer_periph) = (~(uint32_t)(int_flag & TIMER_INT_FLAG_MASK));
}
